podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKE06Z4.h
/**
 * @file      pin_mapping.h (derived from pin_mapping-MKE06Z4.h)
 * @version   1.1.0
 * @brief     Pin declarations for MKE06Z4
 */

#ifndef PIN_MAPPING_H_
#define PIN_MAPPING_H_

#include "derivative.h"

//-------- <<< Use Configuration Wizard in Context Menu >>> -----------------  

//================================
// Validators
// <validate=net.sourceforge.usbdm.annotationEditor.validators.PinMappingValidator>

// <h> Clock settings for FTM0

// FTM0_SC.CLKS ================================
//
//   <o> FTM0_SC.CLKS Clock source
//   <i> Selects the clock source for the FTM0 module. [FTM0_SC.CLKS]
//     <0=> Disabled
//     <1=> System clock
//     <2=> Fixed frequency clock
//     <3=> External clock
//     <1=> Default
// FTM0_SC.PS ================================
//
//   <o1> FTM0_SC.PS Clock prescaler
//   <i> Selects the prescaler for the FTM0 module. [FTM0_SC.PS]
//     <0=> Divide by 1
//     <1=> Divide by 2
//     <2=> Divide by 4
//     <3=> Divide by 8
//     <4=> Divide by 16
//     <5=> Divide by 32
//     <6=> Divide by 64
//     <7=> Divide by 128
//     <0=> Default
#define FTM0_SC              (FTM_SC_CLKS(0x1)|FTM_SC_PS(0x0))

// </h>

// <h> Clock settings for FTM1

// FTM1_SC.CLKS ================================
//
//   <o> FTM1_SC.CLKS Clock source
//   <i> Selects the clock source for the FTM1 module. [FTM1_SC.CLKS]
//     <0=> Disabled
//     <1=> System clock
//     <2=> Fixed frequency clock
//     <3=> External clock
//     <1=> Default
// FTM1_SC.PS ================================
//
//   <o1> FTM1_SC.PS Clock prescaler
//   <i> Selects the prescaler for the FTM1 module. [FTM1_SC.PS]
//     <0=> Divide by 1
//     <1=> Divide by 2
//     <2=> Divide by 4
//     <3=> Divide by 8
//     <4=> Divide by 16
//     <5=> Divide by 32
//     <6=> Divide by 64
//     <7=> Divide by 128
//     <0=> Default
#define FTM1_SC              (FTM_SC_CLKS(0x1)|FTM_SC_PS(0x0))

// </h>

// <h> Clock settings for FTM2

// FTM2_SC.CLKS ================================
//
//   <o> FTM2_SC.CLKS Clock source
//   <i> Selects the clock source for the FTM2 module. [FTM2_SC.CLKS]
//     <0=> Disabled
//     <1=> System clock
//     <2=> Fixed frequency clock
//     <3=> External clock
//     <1=> Default
// FTM2_SC.PS ================================
//
//   <o1> FTM2_SC.PS Clock prescaler
//   <i> Selects the prescaler for the FTM2 module. [FTM2_SC.PS]
//     <0=> Divide by 1
//     <1=> Divide by 2
//     <2=> Divide by 4
//     <3=> Divide by 8
//     <4=> Divide by 16
//     <5=> Divide by 32
//     <6=> Divide by 64
//     <7=> Divide by 128
//     <0=> Default
#define FTM2_SC              (FTM_SC_CLKS(0x1)|FTM_SC_PS(0x0))

// </h>

// Inline port functions
//
//   <q> Force inline port functions 
//   <i> Forces some small GPIO functions to be inlined
//   <i> This increases speed but may also increase code size
//     <0=> Disabled
//     <1=> Enabled
#define DO_INLINE_GPIO       0

// Pin mapping Options
//
//   <q> Map pins 
//   <i> Selects whether pin mappings are done when individual
//   <i> peripherals are configured or during reset initialisation.
//   <i> This will also cause unselected peripherals to be unavailable.
//     <0=> Pins mapped on demand
//     <1=> Pin mapping on reset  - unselected peripherals unavailable
#define DO_MAP_PINS_ON_RESET 0

// Pin peripheral signal mapping
//   <e> Mapping by Pin <name=MAP_BY_PIN>
//   <i> This allows the mapping of peripheral functions to pins
//   <i> to be controlled by individual pin
//     <0=> Disabled
//     <1=> Enabled
#define MAP_BY_PIN_ENABLED   1

// <h> Port A Pins

// Signal mapping for PTA0 pin
//   <o> PTA0 [GPIOA_0, KBI0_P0, FTM0_CH0, I2C0_4WSCLOUT, ACMP0_IN0, ADC0_SE0]<name=PTA0_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTA0 pin
//     <-2=> ADC0_SE0 (reset default)<selection=ADC0_SE0_PIN_SEL,PTA0 (reset default)>
//     <0=> GPIOA_0<selection=GPIOA_0_PIN_SEL,PTA0>
//     <1=> KBI0_P0<selection=KBI0_P0_PIN_SEL,PTA0>
//     <2=> FTM0_CH0<selection=FTM0_CH0_PIN_SEL,PTA0>
//     <3=> I2C0_4WSCLOUT<selection=I2C0_4WSCLOUT_PIN_SEL,PTA0>
//     <4=> ACMP0_IN0<selection=ACMP0_IN0_PIN_SEL,PTA0>
//     <5=> ADC0_SE0<selection=ADC0_SE0_PIN_SEL,PTA0>
//     <-2=> Default
#define PTA0_SIG_SEL         -2

// Signal mapping for PTA1 pin
//   <o> PTA1 [GPIOA_1, KBI0_P1, FTM0_CH1, I2C0_4WSDAOUT, ACMP0_IN1, ADC0_SE1]<name=PTA1_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTA1 pin
//     <-2=> ADC0_SE1 (reset default)<selection=ADC0_SE1_PIN_SEL,PTA1 (reset default)>
//     <0=> GPIOA_1<selection=GPIOA_1_PIN_SEL,PTA1>
//     <1=> KBI0_P1<selection=KBI0_P1_PIN_SEL,PTA1>
//     <2=> FTM0_CH1<selection=FTM0_CH1_PIN_SEL,PTA1>
//     <3=> I2C0_4WSDAOUT<selection=I2C0_4WSDAOUT_PIN_SEL,PTA1>
//     <4=> ACMP0_IN1<selection=ACMP0_IN1_PIN_SEL,PTA1>
//     <5=> ADC0_SE1<selection=ADC0_SE1_PIN_SEL,PTA1>
//     <-2=> Default
#define PTA1_SIG_SEL         -2

// Signal mapping for PTA2 pin
//   <o> PTA2 [GPIOA_2, KBI0_P2, UART0_RX, I2C0_SDA]<name=PTA2_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTA2 pin
//     <-2=> Disabled (reset default)
//     <0=> GPIOA_2<selection=GPIOA_2_PIN_SEL,PTA2>
//     <1=> KBI0_P2<selection=KBI0_P2_PIN_SEL,PTA2>
//     <2=> UART0_RX<selection=UART0_RX_PIN_SEL,PTA2>
//     <3=> I2C0_SDA<selection=I2C0_SDA_PIN_SEL,PTA2>
//     <-2=> Default
#define PTA2_SIG_SEL         -2

// Signal mapping for PTA3 pin
//   <o> PTA3 [GPIOA_3, KBI0_P3, UART0_TX, I2C0_SCL]<name=PTA3_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTA3 pin
//     <-2=> Disabled (reset default)
//     <0=> GPIOA_3<selection=GPIOA_3_PIN_SEL,PTA3>
//     <1=> KBI0_P3<selection=KBI0_P3_PIN_SEL,PTA3>
//     <2=> UART0_TX<selection=UART0_TX_PIN_SEL,PTA3>
//     <3=> I2C0_SCL<selection=I2C0_SCL_PIN_SEL,PTA3>
//     <-2=> Default
#define PTA3_SIG_SEL         -2

// Signal mapping for PTA4 pin
//   <o> PTA4 [GPIOA_4, KBI0_P4, ACMP0_OUT, SWD_DIO]<name=PTA4_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTA4 pin
//     <-2=> SWD_DIO (reset default)<selection=SWD_DIO_PIN_SEL,PTA4 (reset default)>
//     <0=> GPIOA_4<selection=GPIOA_4_PIN_SEL,PTA4>
//     <1=> KBI0_P4<selection=KBI0_P4_PIN_SEL,PTA4>
//     <3=> ACMP0_OUT<selection=ACMP0_OUT_PIN_SEL,PTA4>
//     <4=> SWD_DIO<selection=SWD_DIO_PIN_SEL,PTA4>
//     <-2=> Default
#define PTA4_SIG_SEL         -2

