podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKE06Z4.h
// Signal mapping for PTA5 pin
//   <o> PTA5 [GPIOA_5, KBI0_P5, IRQ, TCLK0, RESET_b]<name=PTA5_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTA5 pin
//     <-2=> RESET_b (reset default)<selection=RESET_b_PIN_SEL,PTA5 (reset default)>
//     <0=> GPIOA_5<selection=GPIOA_5_PIN_SEL,PTA5>
//     <1=> KBI0_P5<selection=KBI0_P5_PIN_SEL,PTA5>
//     <2=> IRQ<selection=IRQ_PIN_SEL,PTA5>
//     <3=> TCLK0<selection=TCLK0_PIN_SEL,PTA5>
//     <4=> RESET_b<selection=RESET_b_PIN_SEL,PTA5>
//     <-2=> Default
#define PTA5_SIG_SEL         -2

// Signal mapping for PTA6 pin
//   <o> PTA6 [GPIOA_6, KBI0_P6, FTM2_FLT1, ACMP1_IN0, ADC0_SE2]<name=PTA6_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTA6 pin
//     <-2=> ADC0_SE2 (reset default)<selection=ADC0_SE2_PIN_SEL,PTA6 (reset default)>
//     <0=> GPIOA_6<selection=GPIOA_6_PIN_SEL,PTA6>
//     <1=> KBI0_P6<selection=KBI0_P6_PIN_SEL,PTA6>
//     <2=> FTM2_FLT1<selection=FTM2_FLT1_PIN_SEL,PTA6>
//     <3=> ACMP1_IN0<selection=ACMP1_IN0_PIN_SEL,PTA6>
//     <4=> ADC0_SE2<selection=ADC0_SE2_PIN_SEL,PTA6>
//     <-2=> Default
#define PTA6_SIG_SEL         -2

// Signal mapping for PTA7 pin
//   <o> PTA7 [GPIOA_7, KBI0_P7, FTM2_FLT2, ACMP1_IN1, ADC0_SE3]<name=PTA7_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTA7 pin
//     <-2=> ADC0_SE3 (reset default)<selection=ADC0_SE3_PIN_SEL,PTA7 (reset default)>
//     <0=> GPIOA_7<selection=GPIOA_7_PIN_SEL,PTA7>
//     <1=> KBI0_P7<selection=KBI0_P7_PIN_SEL,PTA7>
//     <2=> FTM2_FLT2<selection=FTM2_FLT2_PIN_SEL,PTA7>
//     <3=> ACMP1_IN1<selection=ACMP1_IN1_PIN_SEL,PTA7>
//     <4=> ADC0_SE3<selection=ADC0_SE3_PIN_SEL,PTA7>
//     <-2=> Default
#define PTA7_SIG_SEL         -2

// </h>

// <h> Port B Pins

// Signal mapping for PTB0 pin
//   <o> PTB0 [GPIOA_8, KBI0_P8, UART0_RX, PWT_IN1, ADC0_SE4]<name=PTB0_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTB0 pin
//     <-2=> ADC0_SE4 (reset default)<selection=ADC0_SE4_PIN_SEL,PTB0 (reset default)>
//     <0=> GPIOA_8<selection=GPIOA_8_PIN_SEL,PTB0>
//     <1=> KBI0_P8<selection=KBI0_P8_PIN_SEL,PTB0>
//     <2=> UART0_RX<selection=UART0_RX_PIN_SEL,PTB0>
//     <3=> PWT_IN1<selection=PWT_IN1_PIN_SEL,PTB0>
//     <4=> ADC0_SE4<selection=ADC0_SE4_PIN_SEL,PTB0>
//     <-2=> Default
#define PTB0_SIG_SEL         -2

// Signal mapping for PTB1 pin
//   <o> PTB1 [GPIOA_9, KBI0_P9, UART0_TX, ADC0_SE5]<name=PTB1_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTB1 pin
//     <-2=> ADC0_SE5 (reset default)<selection=ADC0_SE5_PIN_SEL,PTB1 (reset default)>
//     <0=> GPIOA_9<selection=GPIOA_9_PIN_SEL,PTB1>
//     <1=> KBI0_P9<selection=KBI0_P9_PIN_SEL,PTB1>
//     <2=> UART0_TX<selection=UART0_TX_PIN_SEL,PTB1>
//     <4=> ADC0_SE5<selection=ADC0_SE5_PIN_SEL,PTB1>
//     <-2=> Default
#define PTB1_SIG_SEL         -2

// Signal mapping for PTB2 pin
//   <o> PTB2 [GPIOA_10, KBI0_P10, SPI0_SCK, FTM0_CH0, ADC0_SE6]<name=PTB2_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTB2 pin
//     <-2=> ADC0_SE6 (reset default)<selection=ADC0_SE6_PIN_SEL,PTB2 (reset default)>
//     <0=> GPIOA_10<selection=GPIOA_10_PIN_SEL,PTB2>
//     <1=> KBI0_P10<selection=KBI0_P10_PIN_SEL,PTB2>
//     <2=> SPI0_SCK<selection=SPI0_SCK_PIN_SEL,PTB2>
//     <3=> FTM0_CH0<selection=FTM0_CH0_PIN_SEL,PTB2>
//     <4=> ADC0_SE6<selection=ADC0_SE6_PIN_SEL,PTB2>
//     <-2=> Default
#define PTB2_SIG_SEL         -2

// Signal mapping for PTB3 pin
//   <o> PTB3 [GPIOA_11, KBI0_P11, SPI0_MOSI, FTM0_CH1, ADC0_SE7]<name=PTB3_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTB3 pin
//     <-2=> ADC0_SE7 (reset default)<selection=ADC0_SE7_PIN_SEL,PTB3 (reset default)>
//     <0=> GPIOA_11<selection=GPIOA_11_PIN_SEL,PTB3>
//     <1=> KBI0_P11<selection=KBI0_P11_PIN_SEL,PTB3>
//     <2=> SPI0_MOSI<selection=SPI0_MOSI_PIN_SEL,PTB3>
//     <3=> FTM0_CH1<selection=FTM0_CH1_PIN_SEL,PTB3>
//     <4=> ADC0_SE7<selection=ADC0_SE7_PIN_SEL,PTB3>
//     <-2=> Default
#define PTB3_SIG_SEL         -2

// Signal mapping for PTB4 pin
//   <o> PTB4 [GPIOA_12, KBI0_P12, FTM2_CH4, SPI0_MISO, ACMP1_IN2, NMI_b]<name=PTB4_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTB4 pin
//     <-2=> NMI_b (reset default)<selection=NMI_b_PIN_SEL,PTB4 (reset default)>
//     <0=> GPIOA_12<selection=GPIOA_12_PIN_SEL,PTB4>
//     <1=> KBI0_P12<selection=KBI0_P12_PIN_SEL,PTB4>
//     <2=> FTM2_CH4<selection=FTM2_CH4_PIN_SEL,PTB4>
//     <3=> SPI0_MISO<selection=SPI0_MISO_PIN_SEL,PTB4>
//     <4=> ACMP1_IN2<selection=ACMP1_IN2_PIN_SEL,PTB4>
//     <5=> NMI_b<selection=NMI_b_PIN_SEL,PTB4>
//     <-2=> Default
#define PTB4_SIG_SEL         -2

// Signal mapping for PTB5 pin
//   <o> PTB5 [GPIOA_13, KBI0_P13, FTM2_CH5, SPI0_PCS, ACMP1_OUT]<name=PTB5_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTB5 pin
//     <-2=> Disabled (reset default)
//     <0=> GPIOA_13<selection=GPIOA_13_PIN_SEL,PTB5>
//     <1=> KBI0_P13<selection=KBI0_P13_PIN_SEL,PTB5>
//     <2=> FTM2_CH5<selection=FTM2_CH5_PIN_SEL,PTB5>
//     <3=> SPI0_PCS<selection=SPI0_PCS_PIN_SEL,PTB5>
//     <4=> ACMP1_OUT<selection=ACMP1_OUT_PIN_SEL,PTB5>
//     <-2=> Default
#define PTB5_SIG_SEL         -2

// Signal mapping for PTB6 pin
//   <o> PTB6 [GPIOA_14, KBI0_P14, I2C0_SDA, XTAL]<name=PTB6_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTB6 pin
//     <-2=> XTAL (reset default)<selection=XTAL_PIN_SEL,PTB6 (reset default)>
//     <0=> GPIOA_14<selection=GPIOA_14_PIN_SEL,PTB6>
//     <1=> KBI0_P14<selection=KBI0_P14_PIN_SEL,PTB6>
//     <2=> I2C0_SDA<selection=I2C0_SDA_PIN_SEL,PTB6>
//     <6=> XTAL<selection=XTAL_PIN_SEL,PTB6>
//     <-2=> Default
#define PTB6_SIG_SEL         -2

// Signal mapping for PTB7 pin
//   <o> PTB7 [GPIOA_15, KBI0_P15, I2C0_SCL, EXTAL]<name=PTB7_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTB7 pin
//     <-2=> EXTAL (reset default)<selection=EXTAL_PIN_SEL,PTB7 (reset default)>
//     <0=> GPIOA_15<selection=GPIOA_15_PIN_SEL,PTB7>
//     <1=> KBI0_P15<selection=KBI0_P15_PIN_SEL,PTB7>
//     <2=> I2C0_SCL<selection=I2C0_SCL_PIN_SEL,PTB7>
//     <6=> EXTAL<selection=EXTAL_PIN_SEL,PTB7>
//     <-2=> Default
#define PTB7_SIG_SEL         -2

