podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKE06Z4.h
// </h>

// <h> Port C Pins

// Signal mapping for PTC0 pin
//   <o> PTC0 [GPIOA_16, KBI0_P16, FTM2_CH0, ADC0_SE8]<name=PTC0_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTC0 pin
//     <-2=> ADC0_SE8 (reset default)<selection=ADC0_SE8_PIN_SEL,PTC0 (reset default)>
//     <0=> GPIOA_16<selection=GPIOA_16_PIN_SEL,PTC0>
//     <1=> KBI0_P16<selection=KBI0_P16_PIN_SEL,PTC0>
//     <2=> FTM2_CH0<selection=FTM2_CH0_PIN_SEL,PTC0>
//     <4=> ADC0_SE8<selection=ADC0_SE8_PIN_SEL,PTC0>
//     <-2=> Default
#define PTC0_SIG_SEL         -2

// Signal mapping for PTC1 pin
//   <o> PTC1 [GPIOA_17, KBI0_P17, FTM2_CH1, ADC0_SE9]<name=PTC1_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTC1 pin
//     <-2=> ADC0_SE9 (reset default)<selection=ADC0_SE9_PIN_SEL,PTC1 (reset default)>
//     <0=> GPIOA_17<selection=GPIOA_17_PIN_SEL,PTC1>
//     <1=> KBI0_P17<selection=KBI0_P17_PIN_SEL,PTC1>
//     <2=> FTM2_CH1<selection=FTM2_CH1_PIN_SEL,PTC1>
//     <4=> ADC0_SE9<selection=ADC0_SE9_PIN_SEL,PTC1>
//     <-2=> Default
#define PTC1_SIG_SEL         -2

// Signal mapping for PTC2 pin
//   <o> PTC2 [GPIOA_18, KBI0_P18, FTM2_CH2, ADC0_SE10]<name=PTC2_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTC2 pin
//     <-2=> ADC0_SE10 (reset default)<selection=ADC0_SE10_PIN_SEL,PTC2 (reset default)>
//     <0=> GPIOA_18<selection=GPIOA_18_PIN_SEL,PTC2>
//     <1=> KBI0_P18<selection=KBI0_P18_PIN_SEL,PTC2>
//     <2=> FTM2_CH2<selection=FTM2_CH2_PIN_SEL,PTC2>
//     <4=> ADC0_SE10<selection=ADC0_SE10_PIN_SEL,PTC2>
//     <-2=> Default
#define PTC2_SIG_SEL         -2

// Signal mapping for PTC3 pin
//   <o> PTC3 [GPIOA_19, KBI0_P19, FTM2_CH3, ADC0_SE11]<name=PTC3_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTC3 pin
//     <-2=> ADC0_SE11 (reset default)<selection=ADC0_SE11_PIN_SEL,PTC3 (reset default)>
//     <0=> GPIOA_19<selection=GPIOA_19_PIN_SEL,PTC3>
//     <1=> KBI0_P19<selection=KBI0_P19_PIN_SEL,PTC3>
//     <2=> FTM2_CH3<selection=FTM2_CH3_PIN_SEL,PTC3>
//     <4=> ADC0_SE11<selection=ADC0_SE11_PIN_SEL,PTC3>
//     <-2=> Default
#define PTC3_SIG_SEL         -2

// Signal mapping for PTC4 pin
//   <o> PTC4 [GPIOA_20, KBI0_P20, RTC_CLKOUT, FTM1_CH0, ACMP0_IN2, SWD_CLK]<name=PTC4_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTC4 pin
//     <-2=> SWD_CLK (reset default)<selection=SWD_CLK_PIN_SEL,PTC4 (reset default)>
//     <0=> GPIOA_20<selection=GPIOA_20_PIN_SEL,PTC4>
//     <1=> KBI0_P20<selection=KBI0_P20_PIN_SEL,PTC4>
//     <2=> RTC_CLKOUT<selection=RTC_CLKOUT_PIN_SEL,PTC4>
//     <3=> FTM1_CH0<selection=FTM1_CH0_PIN_SEL,PTC4>
//     <4=> ACMP0_IN2<selection=ACMP0_IN2_PIN_SEL,PTC4>
//     <5=> SWD_CLK<selection=SWD_CLK_PIN_SEL,PTC4>
//     <-2=> Default
#define PTC4_SIG_SEL         -2

// Signal mapping for PTC5 pin
//   <o> PTC5 [GPIOA_21, KBI0_P21, FTM1_CH1, RTC_CLKOUT]<name=PTC5_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTC5 pin
//     <-2=> Disabled (reset default)
//     <0=> GPIOA_21<selection=GPIOA_21_PIN_SEL,PTC5>
//     <1=> KBI0_P21<selection=KBI0_P21_PIN_SEL,PTC5>
//     <3=> FTM1_CH1<selection=FTM1_CH1_PIN_SEL,PTC5>
//     <5=> RTC_CLKOUT<selection=RTC_CLKOUT_PIN_SEL,PTC5>
//     <-2=> Default
#define PTC5_SIG_SEL         -2

// Signal mapping for PTC6 pin
//   <o> PTC6 [GPIOA_22, KBI0_P22, UART1_RX, CAN0_RX]<name=PTC6_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTC6 pin
//     <-2=> Disabled (reset default)
//     <0=> GPIOA_22<selection=GPIOA_22_PIN_SEL,PTC6>
//     <1=> KBI0_P22<selection=KBI0_P22_PIN_SEL,PTC6>
//     <2=> UART1_RX<selection=UART1_RX_PIN_SEL,PTC6>
//     <5=> CAN0_RX<selection=CAN0_RX_PIN_SEL,PTC6>
//     <-2=> Default
#define PTC6_SIG_SEL         -2

// Signal mapping for PTC7 pin
//   <o> PTC7 [GPIOA_23, KBI0_P23, UART1_TX, CAN0_TX]<name=PTC7_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTC7 pin
//     <-2=> Disabled (reset default)
//     <0=> GPIOA_23<selection=GPIOA_23_PIN_SEL,PTC7>
//     <1=> KBI0_P23<selection=KBI0_P23_PIN_SEL,PTC7>
//     <2=> UART1_TX<selection=UART1_TX_PIN_SEL,PTC7>
//     <5=> CAN0_TX<selection=CAN0_TX_PIN_SEL,PTC7>
//     <-2=> Default
#define PTC7_SIG_SEL         -2

// </h>

// <h> Port D Pins

// Signal mapping for PTD0 pin
//   <o> PTD0 [GPIOA_24, KBI0_P24, FTM2_CH2, SPI1_SCK]<name=PTD0_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTD0 pin
//     <-2=> Disabled (reset default)
//     <0=> GPIOA_24<selection=GPIOA_24_PIN_SEL,PTD0>
//     <1=> KBI0_P24<selection=KBI0_P24_PIN_SEL,PTD0>
//     <2=> FTM2_CH2<selection=FTM2_CH2_PIN_SEL,PTD0>
//     <3=> SPI1_SCK<selection=SPI1_SCK_PIN_SEL,PTD0>
//     <-2=> Default
#define PTD0_SIG_SEL         -2

// Signal mapping for PTD1 pin
//   <o> PTD1 [GPIOA_25, KBI0_P25, FTM2_CH3, SPI1_MOSI]<name=PTD1_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTD1 pin
//     <-2=> Disabled (reset default)
//     <0=> GPIOA_25<selection=GPIOA_25_PIN_SEL,PTD1>
//     <1=> KBI0_P25<selection=KBI0_P25_PIN_SEL,PTD1>
//     <2=> FTM2_CH3<selection=FTM2_CH3_PIN_SEL,PTD1>
//     <3=> SPI1_MOSI<selection=SPI1_MOSI_PIN_SEL,PTD1>
//     <-2=> Default
#define PTD1_SIG_SEL         -2

// Signal mapping for PTD2 pin
//   <o> PTD2 [GPIOA_26, KBI0_P26, SPI1_MISO]<name=PTD2_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTD2 pin
//     <-2=> Disabled (reset default)
//     <0=> GPIOA_26<selection=GPIOA_26_PIN_SEL,PTD2>
//     <1=> KBI0_P26<selection=KBI0_P26_PIN_SEL,PTD2>
//     <2=> SPI1_MISO<selection=SPI1_MISO_PIN_SEL,PTD2>
//     <-2=> Default
#define PTD2_SIG_SEL         -2

// Signal mapping for PTD3 pin
//   <o> PTD3 [GPIOA_27, KBI0_P27, SPI1_PCS]<name=PTD3_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTD3 pin
//     <-2=> Disabled (reset default)
//     <0=> GPIOA_27<selection=GPIOA_27_PIN_SEL,PTD3>
//     <1=> KBI0_P27<selection=KBI0_P27_PIN_SEL,PTD3>
//     <2=> SPI1_PCS<selection=SPI1_PCS_PIN_SEL,PTD3>
//     <-2=> Default
#define PTD3_SIG_SEL         -2

// Signal mapping for PTD4 pin
//   <o> PTD4 [GPIOA_28, KBI0_P28]<name=PTD4_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTD4 pin
//     <-2=> Disabled (reset default)
//     <0=> GPIOA_28<selection=GPIOA_28_PIN_SEL,PTD4>
//     <1=> KBI0_P28<selection=KBI0_P28_PIN_SEL,PTD4>
//     <-2=> Default
#define PTD4_SIG_SEL         -2

// Signal mapping for PTD5 pin
//   <o> PTD5 [GPIOA_29, KBI0_P29, PWT_IN0]<name=PTD5_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTD5 pin
//     <-2=> Disabled (reset default)
//     <0=> GPIOA_29<selection=GPIOA_29_PIN_SEL,PTD5>
//     <1=> KBI0_P29<selection=KBI0_P29_PIN_SEL,PTD5>
//     <2=> PWT_IN0<selection=PWT_IN0_PIN_SEL,PTD5>
//     <-2=> Default
#define PTD5_SIG_SEL         -2

// Signal mapping for PTD6 pin
//   <o> PTD6 [GPIOA_30, KBI0_P30, UART2_RX]<name=PTD6_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTD6 pin
//     <-2=> Disabled (reset default)
//     <0=> GPIOA_30<selection=GPIOA_30_PIN_SEL,PTD6>
//     <1=> KBI0_P30<selection=KBI0_P30_PIN_SEL,PTD6>
//     <2=> UART2_RX<selection=UART2_RX_PIN_SEL,PTD6>
//     <-2=> Default
#define PTD6_SIG_SEL         -2

// Signal mapping for PTD7 pin
//   <o> PTD7 [GPIOA_31, KBI0_P31, UART2_TX]<name=PTD7_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTD7 pin
//     <-2=> Disabled (reset default)
//     <0=> GPIOA_31<selection=GPIOA_31_PIN_SEL,PTD7>
//     <1=> KBI0_P31<selection=KBI0_P31_PIN_SEL,PTD7>
//     <2=> UART2_TX<selection=UART2_TX_PIN_SEL,PTD7>
//     <-2=> Default
#define PTD7_SIG_SEL         -2

