podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKE06Z4.h
// </h>

// <h> Port E Pins

// Signal mapping for PTE0 pin
//   <o> PTE0 [GPIOB_0, KBI1_P0, SPI0_SCK, TCLK1, I2C1_SDA]<name=PTE0_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTE0 pin
//     <-2=> Disabled (reset default)
//     <0=> GPIOB_0<selection=GPIOB_0_PIN_SEL,PTE0>
//     <1=> KBI1_P0<selection=KBI1_P0_PIN_SEL,PTE0>
//     <2=> SPI0_SCK<selection=SPI0_SCK_PIN_SEL,PTE0>
//     <3=> TCLK1<selection=TCLK1_PIN_SEL,PTE0>
//     <4=> I2C1_SDA<selection=I2C1_SDA_PIN_SEL,PTE0>
//     <-2=> Default
#define PTE0_SIG_SEL         -2

// Signal mapping for PTE1 pin
//   <o> PTE1 [GPIOB_1, KBI1_P1, SPI0_MOSI, I2C1_SCL]<name=PTE1_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTE1 pin
//     <-2=> Disabled (reset default)
//     <0=> GPIOB_1<selection=GPIOB_1_PIN_SEL,PTE1>
//     <1=> KBI1_P1<selection=KBI1_P1_PIN_SEL,PTE1>
//     <2=> SPI0_MOSI<selection=SPI0_MOSI_PIN_SEL,PTE1>
//     <4=> I2C1_SCL<selection=I2C1_SCL_PIN_SEL,PTE1>
//     <-2=> Default
#define PTE1_SIG_SEL         -2

// Signal mapping for PTE2 pin
//   <o> PTE2 [GPIOB_2, KBI1_P2, SPI0_MISO, PWT_IN0]<name=PTE2_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTE2 pin
//     <-2=> Disabled (reset default)
//     <0=> GPIOB_2<selection=GPIOB_2_PIN_SEL,PTE2>
//     <1=> KBI1_P2<selection=KBI1_P2_PIN_SEL,PTE2>
//     <2=> SPI0_MISO<selection=SPI0_MISO_PIN_SEL,PTE2>
//     <3=> PWT_IN0<selection=PWT_IN0_PIN_SEL,PTE2>
//     <-2=> Default
#define PTE2_SIG_SEL         -2

// Signal mapping for PTE3 pin
//   <o> PTE3 [GPIOB_3, KBI1_P3, SPI0_PCS]<name=PTE3_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTE3 pin
//     <-2=> Disabled (reset default)
//     <0=> GPIOB_3<selection=GPIOB_3_PIN_SEL,PTE3>
//     <1=> KBI1_P3<selection=KBI1_P3_PIN_SEL,PTE3>
//     <2=> SPI0_PCS<selection=SPI0_PCS_PIN_SEL,PTE3>
//     <-2=> Default
#define PTE3_SIG_SEL         -2

// Signal mapping for PTE4 pin
//   <o> PTE4 [GPIOB_4, KBI1_P4]<name=PTE4_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTE4 pin
//     <-2=> Disabled (reset default)
//     <0=> GPIOB_4<selection=GPIOB_4_PIN_SEL,PTE4>
//     <1=> KBI1_P4<selection=KBI1_P4_PIN_SEL,PTE4>
//     <-2=> Default
#define PTE4_SIG_SEL         -2

// Signal mapping for PTE5 pin
//   <o> PTE5 [GPIOB_5, KBI1_P5]<name=PTE5_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTE5 pin
//     <-2=> Disabled (reset default)
//     <0=> GPIOB_5<selection=GPIOB_5_PIN_SEL,PTE5>
//     <1=> KBI1_P5<selection=KBI1_P5_PIN_SEL,PTE5>
//     <-2=> Default
#define PTE5_SIG_SEL         -2

// Signal mapping for PTE6 pin
//   <o> PTE6 [GPIOB_6, KBI1_P6]<name=PTE6_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTE6 pin
//     <-2=> Disabled (reset default)
//     <0=> GPIOB_6<selection=GPIOB_6_PIN_SEL,PTE6>
//     <1=> KBI1_P6<selection=KBI1_P6_PIN_SEL,PTE6>
//     <-2=> Default
#define PTE6_SIG_SEL         -2

// Signal mapping for PTE7 pin
//   <o> PTE7 [GPIOB_7, KBI1_P7, TCLK2, FTM1_CH1, CAN0_TX]<name=PTE7_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTE7 pin
//     <-2=> Disabled (reset default)
//     <0=> GPIOB_7<selection=GPIOB_7_PIN_SEL,PTE7>
//     <1=> KBI1_P7<selection=KBI1_P7_PIN_SEL,PTE7>
//     <2=> TCLK2<selection=TCLK2_PIN_SEL,PTE7>
//     <4=> FTM1_CH1<selection=FTM1_CH1_PIN_SEL,PTE7>
//     <5=> CAN0_TX<selection=CAN0_TX_PIN_SEL,PTE7>
//     <-2=> Default
#define PTE7_SIG_SEL         -2

// </h>

// <h> Port F Pins

// Signal mapping for PTF0 pin
//   <o> PTF0 [GPIOB_8, KBI1_P8, FTM2_CH0]<name=PTF0_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTF0 pin
//     <-2=> Disabled (reset default)
//     <0=> GPIOB_8<selection=GPIOB_8_PIN_SEL,PTF0>
//     <1=> KBI1_P8<selection=KBI1_P8_PIN_SEL,PTF0>
//     <2=> FTM2_CH0<selection=FTM2_CH0_PIN_SEL,PTF0>
//     <-2=> Default
#define PTF0_SIG_SEL         -2

// Signal mapping for PTF1 pin
//   <o> PTF1 [GPIOB_9, KBI1_P9, FTM2_CH1]<name=PTF1_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTF1 pin
//     <-2=> Disabled (reset default)
//     <0=> GPIOB_9<selection=GPIOB_9_PIN_SEL,PTF1>
//     <1=> KBI1_P9<selection=KBI1_P9_PIN_SEL,PTF1>
//     <2=> FTM2_CH1<selection=FTM2_CH1_PIN_SEL,PTF1>
//     <-2=> Default
#define PTF1_SIG_SEL         -2

// Signal mapping for PTF2 pin
//   <o> PTF2 [GPIOB_10, KBI1_P10, UART1_RX]<name=PTF2_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTF2 pin
//     <-2=> Disabled (reset default)
//     <0=> GPIOB_10<selection=GPIOB_10_PIN_SEL,PTF2>
//     <1=> KBI1_P10<selection=KBI1_P10_PIN_SEL,PTF2>
//     <2=> UART1_RX<selection=UART1_RX_PIN_SEL,PTF2>
//     <-2=> Default
#define PTF2_SIG_SEL         -2

// Signal mapping for PTF3 pin
//   <o> PTF3 [GPIOB_11, KBI1_P11, UART1_TX]<name=PTF3_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTF3 pin
//     <-2=> Disabled (reset default)
//     <0=> GPIOB_11<selection=GPIOB_11_PIN_SEL,PTF3>
//     <1=> KBI1_P11<selection=KBI1_P11_PIN_SEL,PTF3>
//     <2=> UART1_TX<selection=UART1_TX_PIN_SEL,PTF3>
//     <-2=> Default
#define PTF3_SIG_SEL         -2

// Signal mapping for PTF4 pin
//   <o> PTF4 [GPIOB_12, KBI1_P12, ADC0_SE12]<name=PTF4_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTF4 pin
//     <-2=> ADC0_SE12 (reset default)<selection=ADC0_SE12_PIN_SEL,PTF4 (reset default)>
//     <0=> GPIOB_12<selection=GPIOB_12_PIN_SEL,PTF4>
//     <1=> KBI1_P12<selection=KBI1_P12_PIN_SEL,PTF4>
//     <4=> ADC0_SE12<selection=ADC0_SE12_PIN_SEL,PTF4>
//     <-2=> Default
#define PTF4_SIG_SEL         -2

// Signal mapping for PTF5 pin
//   <o> PTF5 [GPIOB_13, KBI1_P13, ADC0_SE13]<name=PTF5_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTF5 pin
//     <-2=> ADC0_SE13 (reset default)<selection=ADC0_SE13_PIN_SEL,PTF5 (reset default)>
//     <0=> GPIOB_13<selection=GPIOB_13_PIN_SEL,PTF5>
//     <1=> KBI1_P13<selection=KBI1_P13_PIN_SEL,PTF5>
//     <4=> ADC0_SE13<selection=ADC0_SE13_PIN_SEL,PTF5>
//     <-2=> Default
#define PTF5_SIG_SEL         -2

