podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKE06Z4.h
// Signal mapping for PTF6 pin
//   <o> PTF6 [GPIOB_14, KBI1_P14, ADC0_SE14]<name=PTF6_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTF6 pin
//     <-2=> ADC0_SE14 (reset default)<selection=ADC0_SE14_PIN_SEL,PTF6 (reset default)>
//     <0=> GPIOB_14<selection=GPIOB_14_PIN_SEL,PTF6>
//     <1=> KBI1_P14<selection=KBI1_P14_PIN_SEL,PTF6>
//     <4=> ADC0_SE14<selection=ADC0_SE14_PIN_SEL,PTF6>
//     <-2=> Default
#define PTF6_SIG_SEL         -2

// Signal mapping for PTF7 pin
//   <o> PTF7 [GPIOB_15, KBI1_P15, ADC0_SE15]<name=PTF7_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTF7 pin
//     <-2=> ADC0_SE15 (reset default)<selection=ADC0_SE15_PIN_SEL,PTF7 (reset default)>
//     <0=> GPIOB_15<selection=GPIOB_15_PIN_SEL,PTF7>
//     <1=> KBI1_P15<selection=KBI1_P15_PIN_SEL,PTF7>
//     <4=> ADC0_SE15<selection=ADC0_SE15_PIN_SEL,PTF7>
//     <-2=> Default
#define PTF7_SIG_SEL         -2

// </h>

// <h> Port G Pins

// Signal mapping for PTG0 pin
//   <o> PTG0 [GPIOB_16, KBI1_P16]<name=PTG0_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTG0 pin
//     <-2=> Disabled (reset default)
//     <0=> GPIOB_16<selection=GPIOB_16_PIN_SEL,PTG0>
//     <1=> KBI1_P16<selection=KBI1_P16_PIN_SEL,PTG0>
//     <-2=> Default
#define PTG0_SIG_SEL         -2

// Signal mapping for PTG1 pin
//   <o> PTG1 [GPIOB_17, KBI1_P17]<name=PTG1_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTG1 pin
//     <-2=> Disabled (reset default)
//     <0=> GPIOB_17<selection=GPIOB_17_PIN_SEL,PTG1>
//     <1=> KBI1_P17<selection=KBI1_P17_PIN_SEL,PTG1>
//     <-2=> Default
#define PTG1_SIG_SEL         -2

// Signal mapping for PTG2 pin
//   <o> PTG2 [GPIOB_18, KBI1_P18]<name=PTG2_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTG2 pin
//     <-2=> Disabled (reset default)
//     <0=> GPIOB_18<selection=GPIOB_18_PIN_SEL,PTG2>
//     <1=> KBI1_P18<selection=KBI1_P18_PIN_SEL,PTG2>
//     <-2=> Default
#define PTG2_SIG_SEL         -2

// Signal mapping for PTG3 pin
//   <o> PTG3 [GPIOB_19, KBI1_P19]<name=PTG3_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTG3 pin
//     <-2=> Disabled (reset default)
//     <0=> GPIOB_19<selection=GPIOB_19_PIN_SEL,PTG3>
//     <1=> KBI1_P19<selection=KBI1_P19_PIN_SEL,PTG3>
//     <-2=> Default
#define PTG3_SIG_SEL         -2

// Signal mapping for PTG4 pin
//   <o> PTG4 [GPIOB_20, KBI1_P20, FTM2_CH2, SPI1_SCK]<name=PTG4_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTG4 pin
//     <-2=> Disabled (reset default)
//     <0=> GPIOB_20<selection=GPIOB_20_PIN_SEL,PTG4>
//     <1=> KBI1_P20<selection=KBI1_P20_PIN_SEL,PTG4>
//     <2=> FTM2_CH2<selection=FTM2_CH2_PIN_SEL,PTG4>
//     <3=> SPI1_SCK<selection=SPI1_SCK_PIN_SEL,PTG4>
//     <-2=> Default
#define PTG4_SIG_SEL         -2

// Signal mapping for PTG5 pin
//   <o> PTG5 (Alias:LED_RED) [GPIOB_21, KBI1_P21, FTM2_CH3, SPI1_MOSI]<name=PTG5_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTG5 pin
//     <-2=> Disabled (reset default)
//     <0=> GPIOB_21<selection=GPIOB_21_PIN_SEL,PTG5 (Alias:LED_RED)>
//     <1=> KBI1_P21<selection=KBI1_P21_PIN_SEL,PTG5 (Alias:LED_RED)>
//     <2=> FTM2_CH3<selection=FTM2_CH3_PIN_SEL,PTG5 (Alias:LED_RED)>
//     <3=> SPI1_MOSI<selection=SPI1_MOSI_PIN_SEL,PTG5 (Alias:LED_RED)>
//     <0=> Default
#define PTG5_SIG_SEL         0

// Signal mapping for PTG6 pin
//   <o> PTG6 (Alias:LED_GREEN) [GPIOB_22, KBI1_P22, FTM2_CH4, SPI1_MISO]<name=PTG6_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTG6 pin
//     <-2=> Disabled (reset default)
//     <0=> GPIOB_22<selection=GPIOB_22_PIN_SEL,PTG6 (Alias:LED_GREEN)>
//     <1=> KBI1_P22<selection=KBI1_P22_PIN_SEL,PTG6 (Alias:LED_GREEN)>
//     <2=> FTM2_CH4<selection=FTM2_CH4_PIN_SEL,PTG6 (Alias:LED_GREEN)>
//     <3=> SPI1_MISO<selection=SPI1_MISO_PIN_SEL,PTG6 (Alias:LED_GREEN)>
//     <0=> Default
#define PTG6_SIG_SEL         0

// Signal mapping for PTG7 pin
//   <o> PTG7 (Alias:LED_BLUE) [GPIOB_23, KBI1_P23, FTM2_CH5, SPI1_PCS]<name=PTG7_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTG7 pin
//     <-2=> Disabled (reset default)
//     <0=> GPIOB_23<selection=GPIOB_23_PIN_SEL,PTG7 (Alias:LED_BLUE)>
//     <1=> KBI1_P23<selection=KBI1_P23_PIN_SEL,PTG7 (Alias:LED_BLUE)>
//     <2=> FTM2_CH5<selection=FTM2_CH5_PIN_SEL,PTG7 (Alias:LED_BLUE)>
//     <3=> SPI1_PCS<selection=SPI1_PCS_PIN_SEL,PTG7 (Alias:LED_BLUE)>
//     <0=> Default
#define PTG7_SIG_SEL         0

// </h>

// <h> Port H Pins

// Signal mapping for PTH0 pin
//   <o> PTH0 [GPIOB_24, KBI1_P24, FTM2_CH0]<name=PTH0_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTH0 pin
//     <-2=> Disabled (reset default)
//     <0=> GPIOB_24<selection=GPIOB_24_PIN_SEL,PTH0>
//     <1=> KBI1_P24<selection=KBI1_P24_PIN_SEL,PTH0>
//     <2=> FTM2_CH0<selection=FTM2_CH0_PIN_SEL,PTH0>
//     <-2=> Default
#define PTH0_SIG_SEL         -2

// Signal mapping for PTH1 pin
//   <o> PTH1 [GPIOB_25, KBI1_P25, FTM2_CH1]<name=PTH1_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTH1 pin
//     <-2=> Disabled (reset default)
//     <0=> GPIOB_25<selection=GPIOB_25_PIN_SEL,PTH1>
//     <1=> KBI1_P25<selection=KBI1_P25_PIN_SEL,PTH1>
//     <2=> FTM2_CH1<selection=FTM2_CH1_PIN_SEL,PTH1>
//     <-2=> Default
#define PTH1_SIG_SEL         -2

// Signal mapping for PTH2 pin
//   <o> PTH2 [GPIOB_26, KBI1_P26, BUSOUT, FTM1_CH0, CAN0_RX]<name=PTH2_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTH2 pin
//     <-2=> Disabled (reset default)
//     <0=> GPIOB_26<selection=GPIOB_26_PIN_SEL,PTH2>
//     <1=> KBI1_P26<selection=KBI1_P26_PIN_SEL,PTH2>
//     <2=> BUSOUT<selection=BUSOUT_PIN_SEL,PTH2>
//     <4=> FTM1_CH0<selection=FTM1_CH0_PIN_SEL,PTH2>
//     <5=> CAN0_RX<selection=CAN0_RX_PIN_SEL,PTH2>
//     <-2=> Default
#define PTH2_SIG_SEL         -2

// Signal mapping for PTH3 pin
//   <o> PTH3 [GPIOB_27, KBI1_P27, I2C1_SDA]<name=PTH3_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTH3 pin
//     <-2=> Disabled (reset default)
//     <0=> GPIOB_27<selection=GPIOB_27_PIN_SEL,PTH3>
//     <1=> KBI1_P27<selection=KBI1_P27_PIN_SEL,PTH3>
//     <2=> I2C1_SDA<selection=I2C1_SDA_PIN_SEL,PTH3>
//     <-2=> Default
#define PTH3_SIG_SEL         -2

