podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKE06Z4.h
// Signal mapping for PTH4 pin
//   <o> PTH4 [GPIOB_28, KBI1_P28, I2C1_SCL]<name=PTH4_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTH4 pin
//     <-2=> Disabled (reset default)
//     <0=> GPIOB_28<selection=GPIOB_28_PIN_SEL,PTH4>
//     <1=> KBI1_P28<selection=KBI1_P28_PIN_SEL,PTH4>
//     <2=> I2C1_SCL<selection=I2C1_SCL_PIN_SEL,PTH4>
//     <-2=> Default
#define PTH4_SIG_SEL         -2

// Signal mapping for PTH5 pin
//   <o> PTH5 [GPIOB_29, KBI1_P29]<name=PTH5_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTH5 pin
//     <-2=> Disabled (reset default)
//     <0=> GPIOB_29<selection=GPIOB_29_PIN_SEL,PTH5>
//     <1=> KBI1_P29<selection=KBI1_P29_PIN_SEL,PTH5>
//     <-2=> Default
#define PTH5_SIG_SEL         -2

// Signal mapping for PTH6 pin
//   <o> PTH6 [GPIOB_30, KBI1_P30]<name=PTH6_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTH6 pin
//     <-2=> Disabled (reset default)
//     <0=> GPIOB_30<selection=GPIOB_30_PIN_SEL,PTH6>
//     <1=> KBI1_P30<selection=KBI1_P30_PIN_SEL,PTH6>
//     <-2=> Default
#define PTH6_SIG_SEL         -2

// Signal mapping for PTH7 pin
//   <o> PTH7 [GPIOB_31, KBI1_P31, PWT_IN1]<name=PTH7_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTH7 pin
//     <-2=> Disabled (reset default)
//     <0=> GPIOB_31<selection=GPIOB_31_PIN_SEL,PTH7>
//     <1=> KBI1_P31<selection=KBI1_P31_PIN_SEL,PTH7>
//     <2=> PWT_IN1<selection=PWT_IN1_PIN_SEL,PTH7>
//     <-2=> Default
#define PTH7_SIG_SEL         -2

// </h>

// <h> Port I Pins

// Signal mapping for PTI0 pin
//   <o> PTI0 [GPIOC_0, IRQ, UART2_RX]<name=PTI0_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTI0 pin
//     <-2=> Disabled (reset default)
//     <0=> GPIOC_0<selection=GPIOC_0_PIN_SEL,PTI0>
//     <2=> IRQ<selection=IRQ_PIN_SEL,PTI0>
//     <3=> UART2_RX<selection=UART2_RX_PIN_SEL,PTI0>
//     <-2=> Default
#define PTI0_SIG_SEL         -2

// Signal mapping for PTI1 pin
//   <o> PTI1 [GPIOC_1, IRQ, UART2_TX]<name=PTI1_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTI1 pin
//     <-2=> Disabled (reset default)
//     <0=> GPIOC_1<selection=GPIOC_1_PIN_SEL,PTI1>
//     <2=> IRQ<selection=IRQ_PIN_SEL,PTI1>
//     <3=> UART2_TX<selection=UART2_TX_PIN_SEL,PTI1>
//     <-2=> Default
#define PTI1_SIG_SEL         -2

// Signal mapping for PTI2 pin
//   <o> PTI2 [GPIOC_2, IRQ]<name=PTI2_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTI2 pin
//     <-2=> Disabled (reset default)
//     <0=> GPIOC_2<selection=GPIOC_2_PIN_SEL,PTI2>
//     <1=> IRQ<selection=IRQ_PIN_SEL,PTI2>
//     <-2=> Default
#define PTI2_SIG_SEL         -2

// Signal mapping for PTI3 pin
//   <o> PTI3 [GPIOC_3, IRQ]<name=PTI3_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTI3 pin
//     <-2=> Disabled (reset default)
//     <0=> GPIOC_3<selection=GPIOC_3_PIN_SEL,PTI3>
//     <1=> IRQ<selection=IRQ_PIN_SEL,PTI3>
//     <-2=> Default
#define PTI3_SIG_SEL         -2

// Signal mapping for PTI4 pin
//   <o> PTI4 [GPIOC_4, IRQ]<name=PTI4_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTI4 pin
//     <-2=> Disabled (reset default)
//     <0=> GPIOC_4<selection=GPIOC_4_PIN_SEL,PTI4>
//     <2=> IRQ<selection=IRQ_PIN_SEL,PTI4>
//     <-2=> Default
#define PTI4_SIG_SEL         -2

// Signal mapping for PTI5 pin
//   <o> PTI5 [GPIOC_5, IRQ]<name=PTI5_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTI5 pin
//     <-2=> Disabled (reset default)
//     <0=> GPIOC_5<selection=GPIOC_5_PIN_SEL,PTI5>
//     <1=> IRQ<selection=IRQ_PIN_SEL,PTI5>
//     <-2=> Default
#define PTI5_SIG_SEL         -2

// Signal mapping for PTI6 pin
//   <o> PTI6 [GPIOC_6, IRQ]<name=PTI6_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTI6 pin
//     <-2=> Disabled (reset default)
//     <0=> GPIOC_6<selection=GPIOC_6_PIN_SEL,PTI6>
//     <1=> IRQ<selection=IRQ_PIN_SEL,PTI6>
//     <-2=> Default
#define PTI6_SIG_SEL         -2

// </h>

// </e>

// Pin peripheral signal mapping
//   <e> Mapping by Peripheral Function <name=MAP_BY_FUNCTION><constant>
//   <i> This allows the mapping of peripheral functions to pins
//   <i> to be controlled by peripheral function.
//   <i> This option is active when Mapping by Pin is disabled
//     <0=> Disabled
//     <1=> Enabled
#define MAP_BY_FUNCTION_ENABLED 0

// <h> Miscellaneous

// Pin Mapping for BUSOUT signal
//   <o> BUSOUT [PTH2]<name=BUSOUT_PIN_SEL>
//   <i> Shows which pin BUSOUT is mapped to
//     <0=> Disabled
//     <1=> PTH2<selection=PTH2_SIG_SEL,BUSOUT>
//     <0=> Default
#define BUSOUT_PIN_SEL       0
#if BUSOUT_PIN_SEL == 1
#define BUSOUT_GPIO          digitalIO_PTH2
#define BUSOUT_FN            2
#endif

// Pin Mapping for IRQ signal
//   <o> IRQ [PTI2, PTI3, PTI5, PTI6, PTA5, PTI0, PTI1, PTI4]<name=IRQ_PIN_SEL>
//   <i> Shows which pin IRQ is mapped to
//     <0=> Disabled
//     <1=> PTI2<selection=PTI2_SIG_SEL,IRQ>
//     <2=> PTI3<selection=PTI3_SIG_SEL,IRQ>
//     <3=> PTI5<selection=PTI5_SIG_SEL,IRQ>
//     <4=> PTI6<selection=PTI6_SIG_SEL,IRQ>
//     <5=> PTA5<selection=PTA5_SIG_SEL,IRQ>
//     <6=> PTI0<selection=PTI0_SIG_SEL,IRQ>
//     <7=> PTI1<selection=PTI1_SIG_SEL,IRQ>
//     <8=> PTI4<selection=PTI4_SIG_SEL,IRQ>
//     <0=> Default
#define IRQ_PIN_SEL          0
#if IRQ_PIN_SEL == 1
#define IRQ_GPIO             digitalIO_PTI2
#define IRQ_FN               1
#elif IRQ_PIN_SEL == 2
#define IRQ_GPIO             digitalIO_PTI3
#define IRQ_FN               1
#elif IRQ_PIN_SEL == 3
#define IRQ_GPIO             digitalIO_PTI5
#define IRQ_FN               1
#elif IRQ_PIN_SEL == 4
#define IRQ_GPIO             digitalIO_PTI6
#define IRQ_FN               1
#elif IRQ_PIN_SEL == 5
#define IRQ_GPIO             digitalIO_PTA5
#define IRQ_FN               2
#elif IRQ_PIN_SEL == 6
#define IRQ_GPIO             digitalIO_PTI0
#define IRQ_FN               2
#elif IRQ_PIN_SEL == 7
#define IRQ_GPIO             digitalIO_PTI1
#define IRQ_FN               2
#elif IRQ_PIN_SEL == 8
#define IRQ_GPIO             digitalIO_PTI4
#define IRQ_FN               2
#endif

