podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKE06Z4.h
// Pin Mapping for KBI0_P0 signal
//   <o> KBI0_P0 [PTA0]<name=KBI0_P0_PIN_SEL>
//   <i> Shows which pin KBI0_P0 is mapped to
//     <0=> Disabled
//     <1=> PTA0<selection=PTA0_SIG_SEL,KBI0_P0>
//     <0=> Default
#define KBI0_P0_PIN_SEL      0
#if KBI0_P0_PIN_SEL == 1
#define KBI0_P0_GPIO         digitalIO_PTA0
#define KBI0_P0_FN           1
#endif

// Pin Mapping for KBI0_P1 signal
//   <o> KBI0_P1 [PTA1]<name=KBI0_P1_PIN_SEL>
//   <i> Shows which pin KBI0_P1 is mapped to
//     <0=> Disabled
//     <1=> PTA1<selection=PTA1_SIG_SEL,KBI0_P1>
//     <0=> Default
#define KBI0_P1_PIN_SEL      0
#if KBI0_P1_PIN_SEL == 1
#define KBI0_P1_GPIO         digitalIO_PTA1
#define KBI0_P1_FN           1
#endif

// Pin Mapping for KBI0_P2 signal
//   <o> KBI0_P2 [PTA2]<name=KBI0_P2_PIN_SEL>
//   <i> Shows which pin KBI0_P2 is mapped to
//     <0=> Disabled
//     <1=> PTA2<selection=PTA2_SIG_SEL,KBI0_P2>
//     <0=> Default
#define KBI0_P2_PIN_SEL      0
#if KBI0_P2_PIN_SEL == 1
#define KBI0_P2_GPIO         digitalIO_PTA2
#define KBI0_P2_FN           1
#endif

// Pin Mapping for KBI0_P3 signal
//   <o> KBI0_P3 [PTA3]<name=KBI0_P3_PIN_SEL>
//   <i> Shows which pin KBI0_P3 is mapped to
//     <0=> Disabled
//     <1=> PTA3<selection=PTA3_SIG_SEL,KBI0_P3>
//     <0=> Default
#define KBI0_P3_PIN_SEL      0
#if KBI0_P3_PIN_SEL == 1
#define KBI0_P3_GPIO         digitalIO_PTA3
#define KBI0_P3_FN           1
#endif

// Pin Mapping for KBI0_P4 signal
//   <o> KBI0_P4 [PTA4]<name=KBI0_P4_PIN_SEL>
//   <i> Shows which pin KBI0_P4 is mapped to
//     <0=> Disabled
//     <1=> PTA4<selection=PTA4_SIG_SEL,KBI0_P4>
//     <0=> Default
#define KBI0_P4_PIN_SEL      0
#if KBI0_P4_PIN_SEL == 1
#define KBI0_P4_GPIO         digitalIO_PTA4
#define KBI0_P4_FN           1
#endif

// Pin Mapping for KBI0_P5 signal
//   <o> KBI0_P5 [PTA5]<name=KBI0_P5_PIN_SEL>
//   <i> Shows which pin KBI0_P5 is mapped to
//     <0=> Disabled
//     <1=> PTA5<selection=PTA5_SIG_SEL,KBI0_P5>
//     <0=> Default
#define KBI0_P5_PIN_SEL      0
#if KBI0_P5_PIN_SEL == 1
#define KBI0_P5_GPIO         digitalIO_PTA5
#define KBI0_P5_FN           1
#endif

// Pin Mapping for KBI0_P6 signal
//   <o> KBI0_P6 [PTA6]<name=KBI0_P6_PIN_SEL>
//   <i> Shows which pin KBI0_P6 is mapped to
//     <0=> Disabled
//     <1=> PTA6<selection=PTA6_SIG_SEL,KBI0_P6>
//     <0=> Default
#define KBI0_P6_PIN_SEL      0
#if KBI0_P6_PIN_SEL == 1
#define KBI0_P6_GPIO         digitalIO_PTA6
#define KBI0_P6_FN           1
#endif

// Pin Mapping for KBI0_P7 signal
//   <o> KBI0_P7 [PTA7]<name=KBI0_P7_PIN_SEL>
//   <i> Shows which pin KBI0_P7 is mapped to
//     <0=> Disabled
//     <1=> PTA7<selection=PTA7_SIG_SEL,KBI0_P7>
//     <0=> Default
#define KBI0_P7_PIN_SEL      0
#if KBI0_P7_PIN_SEL == 1
#define KBI0_P7_GPIO         digitalIO_PTA7
#define KBI0_P7_FN           1
#endif

// Pin Mapping for KBI0_P8 signal
//   <o> KBI0_P8 [PTB0]<name=KBI0_P8_PIN_SEL>
//   <i> Shows which pin KBI0_P8 is mapped to
//     <0=> Disabled
//     <1=> PTB0<selection=PTB0_SIG_SEL,KBI0_P8>
//     <0=> Default
#define KBI0_P8_PIN_SEL      0
#if KBI0_P8_PIN_SEL == 1
#define KBI0_P8_GPIO         digitalIO_PTB0
#define KBI0_P8_FN           1
#endif

// Pin Mapping for KBI0_P9 signal
//   <o> KBI0_P9 [PTB1]<name=KBI0_P9_PIN_SEL>
//   <i> Shows which pin KBI0_P9 is mapped to
//     <0=> Disabled
//     <1=> PTB1<selection=PTB1_SIG_SEL,KBI0_P9>
//     <0=> Default
#define KBI0_P9_PIN_SEL      0
#if KBI0_P9_PIN_SEL == 1
#define KBI0_P9_GPIO         digitalIO_PTB1
#define KBI0_P9_FN           1
#endif

// Pin Mapping for KBI0_P10 signal
//   <o> KBI0_P10 [PTB2]<name=KBI0_P10_PIN_SEL>
//   <i> Shows which pin KBI0_P10 is mapped to
//     <0=> Disabled
//     <1=> PTB2<selection=PTB2_SIG_SEL,KBI0_P10>
//     <0=> Default
#define KBI0_P10_PIN_SEL     0
#if KBI0_P10_PIN_SEL == 1
#define KBI0_P10_GPIO        digitalIO_PTB2
#define KBI0_P10_FN          1
#endif

// Pin Mapping for KBI0_P11 signal
//   <o> KBI0_P11 [PTB3]<name=KBI0_P11_PIN_SEL>
//   <i> Shows which pin KBI0_P11 is mapped to
//     <0=> Disabled
//     <1=> PTB3<selection=PTB3_SIG_SEL,KBI0_P11>
//     <0=> Default
#define KBI0_P11_PIN_SEL     0
#if KBI0_P11_PIN_SEL == 1
#define KBI0_P11_GPIO        digitalIO_PTB3
#define KBI0_P11_FN          1
#endif

// Pin Mapping for KBI0_P12 signal
//   <o> KBI0_P12 [PTB4]<name=KBI0_P12_PIN_SEL>
//   <i> Shows which pin KBI0_P12 is mapped to
//     <0=> Disabled
//     <1=> PTB4<selection=PTB4_SIG_SEL,KBI0_P12>
//     <0=> Default
#define KBI0_P12_PIN_SEL     0
#if KBI0_P12_PIN_SEL == 1
#define KBI0_P12_GPIO        digitalIO_PTB4
#define KBI0_P12_FN          1
#endif

// Pin Mapping for KBI0_P13 signal
//   <o> KBI0_P13 [PTB5]<name=KBI0_P13_PIN_SEL>
//   <i> Shows which pin KBI0_P13 is mapped to
//     <0=> Disabled
//     <1=> PTB5<selection=PTB5_SIG_SEL,KBI0_P13>
//     <0=> Default
#define KBI0_P13_PIN_SEL     0
#if KBI0_P13_PIN_SEL == 1
#define KBI0_P13_GPIO        digitalIO_PTB5
#define KBI0_P13_FN          1
#endif

// Pin Mapping for KBI0_P14 signal
//   <o> KBI0_P14 [PTB6]<name=KBI0_P14_PIN_SEL>
//   <i> Shows which pin KBI0_P14 is mapped to
//     <0=> Disabled
//     <1=> PTB6<selection=PTB6_SIG_SEL,KBI0_P14>
//     <0=> Default
#define KBI0_P14_PIN_SEL     0
#if KBI0_P14_PIN_SEL == 1
#define KBI0_P14_GPIO        digitalIO_PTB6
#define KBI0_P14_FN          1
#endif

// Pin Mapping for KBI0_P15 signal
//   <o> KBI0_P15 [PTB7]<name=KBI0_P15_PIN_SEL>
//   <i> Shows which pin KBI0_P15 is mapped to
//     <0=> Disabled
//     <1=> PTB7<selection=PTB7_SIG_SEL,KBI0_P15>
//     <0=> Default
#define KBI0_P15_PIN_SEL     0
#if KBI0_P15_PIN_SEL == 1
#define KBI0_P15_GPIO        digitalIO_PTB7
#define KBI0_P15_FN          1
#endif

// Pin Mapping for KBI0_P16 signal
//   <o> KBI0_P16 [PTC0]<name=KBI0_P16_PIN_SEL>
//   <i> Shows which pin KBI0_P16 is mapped to
//     <0=> Disabled
//     <1=> PTC0<selection=PTC0_SIG_SEL,KBI0_P16>
//     <0=> Default
#define KBI0_P16_PIN_SEL     0
#if KBI0_P16_PIN_SEL == 1
#define KBI0_P16_GPIO        digitalIO_PTC0
#define KBI0_P16_FN          1
#endif

// Pin Mapping for KBI0_P17 signal
//   <o> KBI0_P17 [PTC1]<name=KBI0_P17_PIN_SEL>
//   <i> Shows which pin KBI0_P17 is mapped to
//     <0=> Disabled
//     <1=> PTC1<selection=PTC1_SIG_SEL,KBI0_P17>
//     <0=> Default
#define KBI0_P17_PIN_SEL     0
#if KBI0_P17_PIN_SEL == 1
#define KBI0_P17_GPIO        digitalIO_PTC1
#define KBI0_P17_FN          1
#endif

// Pin Mapping for KBI0_P18 signal
//   <o> KBI0_P18 [PTC2]<name=KBI0_P18_PIN_SEL>
//   <i> Shows which pin KBI0_P18 is mapped to
//     <0=> Disabled
//     <1=> PTC2<selection=PTC2_SIG_SEL,KBI0_P18>
//     <0=> Default
#define KBI0_P18_PIN_SEL     0
#if KBI0_P18_PIN_SEL == 1
#define KBI0_P18_GPIO        digitalIO_PTC2
#define KBI0_P18_FN          1
#endif

// Pin Mapping for KBI0_P19 signal
//   <o> KBI0_P19 [PTC3]<name=KBI0_P19_PIN_SEL>
//   <i> Shows which pin KBI0_P19 is mapped to
//     <0=> Disabled
//     <1=> PTC3<selection=PTC3_SIG_SEL,KBI0_P19>
//     <0=> Default
#define KBI0_P19_PIN_SEL     0
#if KBI0_P19_PIN_SEL == 1
#define KBI0_P19_GPIO        digitalIO_PTC3
#define KBI0_P19_FN          1
#endif

// Pin Mapping for KBI0_P20 signal
//   <o> KBI0_P20 [PTC4]<name=KBI0_P20_PIN_SEL>
//   <i> Shows which pin KBI0_P20 is mapped to
//     <0=> Disabled
//     <1=> PTC4<selection=PTC4_SIG_SEL,KBI0_P20>
//     <0=> Default
#define KBI0_P20_PIN_SEL     0
#if KBI0_P20_PIN_SEL == 1
#define KBI0_P20_GPIO        digitalIO_PTC4
#define KBI0_P20_FN          1
#endif

// Pin Mapping for KBI0_P21 signal
//   <o> KBI0_P21 [PTC5]<name=KBI0_P21_PIN_SEL>
//   <i> Shows which pin KBI0_P21 is mapped to
//     <0=> Disabled
//     <1=> PTC5<selection=PTC5_SIG_SEL,KBI0_P21>
//     <0=> Default
#define KBI0_P21_PIN_SEL     0
#if KBI0_P21_PIN_SEL == 1
#define KBI0_P21_GPIO        digitalIO_PTC5
#define KBI0_P21_FN          1
#endif

