podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKE06Z4.h
// Pin Mapping for KBI0_P22 signal
//   <o> KBI0_P22 [PTC6]<name=KBI0_P22_PIN_SEL>
//   <i> Shows which pin KBI0_P22 is mapped to
//     <0=> Disabled
//     <1=> PTC6<selection=PTC6_SIG_SEL,KBI0_P22>
//     <0=> Default
#define KBI0_P22_PIN_SEL     0
#if KBI0_P22_PIN_SEL == 1
#define KBI0_P22_GPIO        digitalIO_PTC6
#define KBI0_P22_FN          1
#endif

// Pin Mapping for KBI0_P23 signal
//   <o> KBI0_P23 [PTC7]<name=KBI0_P23_PIN_SEL>
//   <i> Shows which pin KBI0_P23 is mapped to
//     <0=> Disabled
//     <1=> PTC7<selection=PTC7_SIG_SEL,KBI0_P23>
//     <0=> Default
#define KBI0_P23_PIN_SEL     0
#if KBI0_P23_PIN_SEL == 1
#define KBI0_P23_GPIO        digitalIO_PTC7
#define KBI0_P23_FN          1
#endif

// Pin Mapping for KBI0_P24 signal
//   <o> KBI0_P24 [PTD0]<name=KBI0_P24_PIN_SEL>
//   <i> Shows which pin KBI0_P24 is mapped to
//     <0=> Disabled
//     <1=> PTD0<selection=PTD0_SIG_SEL,KBI0_P24>
//     <0=> Default
#define KBI0_P24_PIN_SEL     0
#if KBI0_P24_PIN_SEL == 1
#define KBI0_P24_GPIO        digitalIO_PTD0
#define KBI0_P24_FN          1
#endif

// Pin Mapping for KBI0_P25 signal
//   <o> KBI0_P25 [PTD1]<name=KBI0_P25_PIN_SEL>
//   <i> Shows which pin KBI0_P25 is mapped to
//     <0=> Disabled
//     <1=> PTD1<selection=PTD1_SIG_SEL,KBI0_P25>
//     <0=> Default
#define KBI0_P25_PIN_SEL     0
#if KBI0_P25_PIN_SEL == 1
#define KBI0_P25_GPIO        digitalIO_PTD1
#define KBI0_P25_FN          1
#endif

// Pin Mapping for KBI0_P26 signal
//   <o> KBI0_P26 [PTD2]<name=KBI0_P26_PIN_SEL>
//   <i> Shows which pin KBI0_P26 is mapped to
//     <0=> Disabled
//     <1=> PTD2<selection=PTD2_SIG_SEL,KBI0_P26>
//     <0=> Default
#define KBI0_P26_PIN_SEL     0
#if KBI0_P26_PIN_SEL == 1
#define KBI0_P26_GPIO        digitalIO_PTD2
#define KBI0_P26_FN          1
#endif

// Pin Mapping for KBI0_P27 signal
//   <o> KBI0_P27 [PTD3]<name=KBI0_P27_PIN_SEL>
//   <i> Shows which pin KBI0_P27 is mapped to
//     <0=> Disabled
//     <1=> PTD3<selection=PTD3_SIG_SEL,KBI0_P27>
//     <0=> Default
#define KBI0_P27_PIN_SEL     0
#if KBI0_P27_PIN_SEL == 1
#define KBI0_P27_GPIO        digitalIO_PTD3
#define KBI0_P27_FN          1
#endif

// Pin Mapping for KBI0_P28 signal
//   <o> KBI0_P28 [PTD4]<name=KBI0_P28_PIN_SEL>
//   <i> Shows which pin KBI0_P28 is mapped to
//     <0=> Disabled
//     <1=> PTD4<selection=PTD4_SIG_SEL,KBI0_P28>
//     <0=> Default
#define KBI0_P28_PIN_SEL     0
#if KBI0_P28_PIN_SEL == 1
#define KBI0_P28_GPIO        digitalIO_PTD4
#define KBI0_P28_FN          1
#endif

// Pin Mapping for KBI0_P29 signal
//   <o> KBI0_P29 [PTD5]<name=KBI0_P29_PIN_SEL>
//   <i> Shows which pin KBI0_P29 is mapped to
//     <0=> Disabled
//     <1=> PTD5<selection=PTD5_SIG_SEL,KBI0_P29>
//     <0=> Default
#define KBI0_P29_PIN_SEL     0
#if KBI0_P29_PIN_SEL == 1
#define KBI0_P29_GPIO        digitalIO_PTD5
#define KBI0_P29_FN          1
#endif

// Pin Mapping for KBI0_P30 signal
//   <o> KBI0_P30 [PTD6]<name=KBI0_P30_PIN_SEL>
//   <i> Shows which pin KBI0_P30 is mapped to
//     <0=> Disabled
//     <1=> PTD6<selection=PTD6_SIG_SEL,KBI0_P30>
//     <0=> Default
#define KBI0_P30_PIN_SEL     0
#if KBI0_P30_PIN_SEL == 1
#define KBI0_P30_GPIO        digitalIO_PTD6
#define KBI0_P30_FN          1
#endif

// Pin Mapping for KBI0_P31 signal
//   <o> KBI0_P31 [PTD7]<name=KBI0_P31_PIN_SEL>
//   <i> Shows which pin KBI0_P31 is mapped to
//     <0=> Disabled
//     <1=> PTD7<selection=PTD7_SIG_SEL,KBI0_P31>
//     <0=> Default
#define KBI0_P31_PIN_SEL     0
#if KBI0_P31_PIN_SEL == 1
#define KBI0_P31_GPIO        digitalIO_PTD7
#define KBI0_P31_FN          1
#endif

// Pin Mapping for KBI1_P0 signal
//   <o> KBI1_P0 [PTE0]<name=KBI1_P0_PIN_SEL>
//   <i> Shows which pin KBI1_P0 is mapped to
//     <0=> Disabled
//     <1=> PTE0<selection=PTE0_SIG_SEL,KBI1_P0>
//     <0=> Default
#define KBI1_P0_PIN_SEL      0
#if KBI1_P0_PIN_SEL == 1
#define KBI1_P0_GPIO         digitalIO_PTE0
#define KBI1_P0_FN           1
#endif

// Pin Mapping for KBI1_P1 signal
//   <o> KBI1_P1 [PTE1]<name=KBI1_P1_PIN_SEL>
//   <i> Shows which pin KBI1_P1 is mapped to
//     <0=> Disabled
//     <1=> PTE1<selection=PTE1_SIG_SEL,KBI1_P1>
//     <0=> Default
#define KBI1_P1_PIN_SEL      0
#if KBI1_P1_PIN_SEL == 1
#define KBI1_P1_GPIO         digitalIO_PTE1
#define KBI1_P1_FN           1
#endif

// Pin Mapping for KBI1_P2 signal
//   <o> KBI1_P2 [PTE2]<name=KBI1_P2_PIN_SEL>
//   <i> Shows which pin KBI1_P2 is mapped to
//     <0=> Disabled
//     <1=> PTE2<selection=PTE2_SIG_SEL,KBI1_P2>
//     <0=> Default
#define KBI1_P2_PIN_SEL      0
#if KBI1_P2_PIN_SEL == 1
#define KBI1_P2_GPIO         digitalIO_PTE2
#define KBI1_P2_FN           1
#endif

// Pin Mapping for KBI1_P3 signal
//   <o> KBI1_P3 [PTE3]<name=KBI1_P3_PIN_SEL>
//   <i> Shows which pin KBI1_P3 is mapped to
//     <0=> Disabled
//     <1=> PTE3<selection=PTE3_SIG_SEL,KBI1_P3>
//     <0=> Default
#define KBI1_P3_PIN_SEL      0
#if KBI1_P3_PIN_SEL == 1
#define KBI1_P3_GPIO         digitalIO_PTE3
#define KBI1_P3_FN           1
#endif

// Pin Mapping for KBI1_P4 signal
//   <o> KBI1_P4 [PTE4]<name=KBI1_P4_PIN_SEL>
//   <i> Shows which pin KBI1_P4 is mapped to
//     <0=> Disabled
//     <1=> PTE4<selection=PTE4_SIG_SEL,KBI1_P4>
//     <0=> Default
#define KBI1_P4_PIN_SEL      0
#if KBI1_P4_PIN_SEL == 1
#define KBI1_P4_GPIO         digitalIO_PTE4
#define KBI1_P4_FN           1
#endif

// Pin Mapping for KBI1_P5 signal
//   <o> KBI1_P5 [PTE5]<name=KBI1_P5_PIN_SEL>
//   <i> Shows which pin KBI1_P5 is mapped to
//     <0=> Disabled
//     <1=> PTE5<selection=PTE5_SIG_SEL,KBI1_P5>
//     <0=> Default
#define KBI1_P5_PIN_SEL      0
#if KBI1_P5_PIN_SEL == 1
#define KBI1_P5_GPIO         digitalIO_PTE5
#define KBI1_P5_FN           1
#endif

// Pin Mapping for KBI1_P6 signal
//   <o> KBI1_P6 [PTE6]<name=KBI1_P6_PIN_SEL>
//   <i> Shows which pin KBI1_P6 is mapped to
//     <0=> Disabled
//     <1=> PTE6<selection=PTE6_SIG_SEL,KBI1_P6>
//     <0=> Default
#define KBI1_P6_PIN_SEL      0
#if KBI1_P6_PIN_SEL == 1
#define KBI1_P6_GPIO         digitalIO_PTE6
#define KBI1_P6_FN           1
#endif

// Pin Mapping for KBI1_P7 signal
//   <o> KBI1_P7 [PTE7]<name=KBI1_P7_PIN_SEL>
//   <i> Shows which pin KBI1_P7 is mapped to
//     <0=> Disabled
//     <1=> PTE7<selection=PTE7_SIG_SEL,KBI1_P7>
//     <0=> Default
#define KBI1_P7_PIN_SEL      0
#if KBI1_P7_PIN_SEL == 1
#define KBI1_P7_GPIO         digitalIO_PTE7
#define KBI1_P7_FN           1
#endif

// Pin Mapping for KBI1_P8 signal
//   <o> KBI1_P8 [PTF0]<name=KBI1_P8_PIN_SEL>
//   <i> Shows which pin KBI1_P8 is mapped to
//     <0=> Disabled
//     <1=> PTF0<selection=PTF0_SIG_SEL,KBI1_P8>
//     <0=> Default
#define KBI1_P8_PIN_SEL      0
#if KBI1_P8_PIN_SEL == 1
#define KBI1_P8_GPIO         digitalIO_PTF0
#define KBI1_P8_FN           1
#endif

// Pin Mapping for KBI1_P9 signal
//   <o> KBI1_P9 [PTF1]<name=KBI1_P9_PIN_SEL>
//   <i> Shows which pin KBI1_P9 is mapped to
//     <0=> Disabled
//     <1=> PTF1<selection=PTF1_SIG_SEL,KBI1_P9>
//     <0=> Default
#define KBI1_P9_PIN_SEL      0
#if KBI1_P9_PIN_SEL == 1
#define KBI1_P9_GPIO         digitalIO_PTF1
#define KBI1_P9_FN           1
#endif

// Pin Mapping for KBI1_P10 signal
//   <o> KBI1_P10 [PTF2]<name=KBI1_P10_PIN_SEL>
//   <i> Shows which pin KBI1_P10 is mapped to
//     <0=> Disabled
//     <1=> PTF2<selection=PTF2_SIG_SEL,KBI1_P10>
//     <0=> Default
#define KBI1_P10_PIN_SEL     0
#if KBI1_P10_PIN_SEL == 1
#define KBI1_P10_GPIO        digitalIO_PTF2
#define KBI1_P10_FN          1
#endif

// Pin Mapping for KBI1_P11 signal
//   <o> KBI1_P11 [PTF3]<name=KBI1_P11_PIN_SEL>
//   <i> Shows which pin KBI1_P11 is mapped to
//     <0=> Disabled
//     <1=> PTF3<selection=PTF3_SIG_SEL,KBI1_P11>
//     <0=> Default
#define KBI1_P11_PIN_SEL     0
#if KBI1_P11_PIN_SEL == 1
#define KBI1_P11_GPIO        digitalIO_PTF3
#define KBI1_P11_FN          1
#endif

// Pin Mapping for KBI1_P12 signal
//   <o> KBI1_P12 [PTF4]<name=KBI1_P12_PIN_SEL>
//   <i> Shows which pin KBI1_P12 is mapped to
//     <0=> Disabled
//     <1=> PTF4<selection=PTF4_SIG_SEL,KBI1_P12>
//     <0=> Default
#define KBI1_P12_PIN_SEL     0
#if KBI1_P12_PIN_SEL == 1
#define KBI1_P12_GPIO        digitalIO_PTF4
#define KBI1_P12_FN          1
#endif

