podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKE06Z4.h
// Pin Mapping for KBI1_P13 signal
//   <o> KBI1_P13 [PTF5]<name=KBI1_P13_PIN_SEL>
//   <i> Shows which pin KBI1_P13 is mapped to
//     <0=> Disabled
//     <1=> PTF5<selection=PTF5_SIG_SEL,KBI1_P13>
//     <0=> Default
#define KBI1_P13_PIN_SEL     0
#if KBI1_P13_PIN_SEL == 1
#define KBI1_P13_GPIO        digitalIO_PTF5
#define KBI1_P13_FN          1
#endif

// Pin Mapping for KBI1_P14 signal
//   <o> KBI1_P14 [PTF6]<name=KBI1_P14_PIN_SEL>
//   <i> Shows which pin KBI1_P14 is mapped to
//     <0=> Disabled
//     <1=> PTF6<selection=PTF6_SIG_SEL,KBI1_P14>
//     <0=> Default
#define KBI1_P14_PIN_SEL     0
#if KBI1_P14_PIN_SEL == 1
#define KBI1_P14_GPIO        digitalIO_PTF6
#define KBI1_P14_FN          1
#endif

// Pin Mapping for KBI1_P15 signal
//   <o> KBI1_P15 [PTF7]<name=KBI1_P15_PIN_SEL>
//   <i> Shows which pin KBI1_P15 is mapped to
//     <0=> Disabled
//     <1=> PTF7<selection=PTF7_SIG_SEL,KBI1_P15>
//     <0=> Default
#define KBI1_P15_PIN_SEL     0
#if KBI1_P15_PIN_SEL == 1
#define KBI1_P15_GPIO        digitalIO_PTF7
#define KBI1_P15_FN          1
#endif

// Pin Mapping for KBI1_P16 signal
//   <o> KBI1_P16 [PTG0]<name=KBI1_P16_PIN_SEL>
//   <i> Shows which pin KBI1_P16 is mapped to
//     <0=> Disabled
//     <1=> PTG0<selection=PTG0_SIG_SEL,KBI1_P16>
//     <0=> Default
#define KBI1_P16_PIN_SEL     0
#if KBI1_P16_PIN_SEL == 1
#define KBI1_P16_GPIO        digitalIO_PTG0
#define KBI1_P16_FN          1
#endif

// Pin Mapping for KBI1_P17 signal
//   <o> KBI1_P17 [PTG1]<name=KBI1_P17_PIN_SEL>
//   <i> Shows which pin KBI1_P17 is mapped to
//     <0=> Disabled
//     <1=> PTG1<selection=PTG1_SIG_SEL,KBI1_P17>
//     <0=> Default
#define KBI1_P17_PIN_SEL     0
#if KBI1_P17_PIN_SEL == 1
#define KBI1_P17_GPIO        digitalIO_PTG1
#define KBI1_P17_FN          1
#endif

// Pin Mapping for KBI1_P18 signal
//   <o> KBI1_P18 [PTG2]<name=KBI1_P18_PIN_SEL>
//   <i> Shows which pin KBI1_P18 is mapped to
//     <0=> Disabled
//     <1=> PTG2<selection=PTG2_SIG_SEL,KBI1_P18>
//     <0=> Default
#define KBI1_P18_PIN_SEL     0
#if KBI1_P18_PIN_SEL == 1
#define KBI1_P18_GPIO        digitalIO_PTG2
#define KBI1_P18_FN          1
#endif

// Pin Mapping for KBI1_P19 signal
//   <o> KBI1_P19 [PTG3]<name=KBI1_P19_PIN_SEL>
//   <i> Shows which pin KBI1_P19 is mapped to
//     <0=> Disabled
//     <1=> PTG3<selection=PTG3_SIG_SEL,KBI1_P19>
//     <0=> Default
#define KBI1_P19_PIN_SEL     0
#if KBI1_P19_PIN_SEL == 1
#define KBI1_P19_GPIO        digitalIO_PTG3
#define KBI1_P19_FN          1
#endif

// Pin Mapping for KBI1_P20 signal
//   <o> KBI1_P20 [PTG4]<name=KBI1_P20_PIN_SEL>
//   <i> Shows which pin KBI1_P20 is mapped to
//     <0=> Disabled
//     <1=> PTG4<selection=PTG4_SIG_SEL,KBI1_P20>
//     <0=> Default
#define KBI1_P20_PIN_SEL     0
#if KBI1_P20_PIN_SEL == 1
#define KBI1_P20_GPIO        digitalIO_PTG4
#define KBI1_P20_FN          1
#endif

// Pin Mapping for KBI1_P21 signal
//   <o> KBI1_P21 [PTG5]<name=KBI1_P21_PIN_SEL>
//   <i> Shows which pin KBI1_P21 is mapped to
//     <0=> Disabled
//     <1=> PTG5 (Alias:LED_RED)<selection=PTG5_SIG_SEL,KBI1_P21>
//     <0=> Default
#define KBI1_P21_PIN_SEL     0
#if KBI1_P21_PIN_SEL == 1
#define KBI1_P21_GPIO        digitalIO_PTG5
#define KBI1_P21_FN          1
#endif

// Pin Mapping for KBI1_P22 signal
//   <o> KBI1_P22 [PTG6]<name=KBI1_P22_PIN_SEL>
//   <i> Shows which pin KBI1_P22 is mapped to
//     <0=> Disabled
//     <1=> PTG6 (Alias:LED_GREEN)<selection=PTG6_SIG_SEL,KBI1_P22>
//     <0=> Default
#define KBI1_P22_PIN_SEL     0
#if KBI1_P22_PIN_SEL == 1
#define KBI1_P22_GPIO        digitalIO_PTG6
#define KBI1_P22_FN          1
#endif

// Pin Mapping for KBI1_P23 signal
//   <o> KBI1_P23 [PTG7]<name=KBI1_P23_PIN_SEL>
//   <i> Shows which pin KBI1_P23 is mapped to
//     <0=> Disabled
//     <1=> PTG7 (Alias:LED_BLUE)<selection=PTG7_SIG_SEL,KBI1_P23>
//     <0=> Default
#define KBI1_P23_PIN_SEL     0
#if KBI1_P23_PIN_SEL == 1
#define KBI1_P23_GPIO        digitalIO_PTG7
#define KBI1_P23_FN          1
#endif

// Pin Mapping for KBI1_P24 signal
//   <o> KBI1_P24 [PTH0]<name=KBI1_P24_PIN_SEL>
//   <i> Shows which pin KBI1_P24 is mapped to
//     <0=> Disabled
//     <1=> PTH0<selection=PTH0_SIG_SEL,KBI1_P24>
//     <0=> Default
#define KBI1_P24_PIN_SEL     0
#if KBI1_P24_PIN_SEL == 1
#define KBI1_P24_GPIO        digitalIO_PTH0
#define KBI1_P24_FN          1
#endif

// Pin Mapping for KBI1_P25 signal
//   <o> KBI1_P25 [PTH1]<name=KBI1_P25_PIN_SEL>
//   <i> Shows which pin KBI1_P25 is mapped to
//     <0=> Disabled
//     <1=> PTH1<selection=PTH1_SIG_SEL,KBI1_P25>
//     <0=> Default
#define KBI1_P25_PIN_SEL     0
#if KBI1_P25_PIN_SEL == 1
#define KBI1_P25_GPIO        digitalIO_PTH1
#define KBI1_P25_FN          1
#endif

// Pin Mapping for KBI1_P26 signal
//   <o> KBI1_P26 [PTH2]<name=KBI1_P26_PIN_SEL>
//   <i> Shows which pin KBI1_P26 is mapped to
//     <0=> Disabled
//     <1=> PTH2<selection=PTH2_SIG_SEL,KBI1_P26>
//     <0=> Default
#define KBI1_P26_PIN_SEL     0
#if KBI1_P26_PIN_SEL == 1
#define KBI1_P26_GPIO        digitalIO_PTH2
#define KBI1_P26_FN          1
#endif

// Pin Mapping for KBI1_P27 signal
//   <o> KBI1_P27 [PTH3]<name=KBI1_P27_PIN_SEL>
//   <i> Shows which pin KBI1_P27 is mapped to
//     <0=> Disabled
//     <1=> PTH3<selection=PTH3_SIG_SEL,KBI1_P27>
//     <0=> Default
#define KBI1_P27_PIN_SEL     0
#if KBI1_P27_PIN_SEL == 1
#define KBI1_P27_GPIO        digitalIO_PTH3
#define KBI1_P27_FN          1
#endif

// Pin Mapping for KBI1_P28 signal
//   <o> KBI1_P28 [PTH4]<name=KBI1_P28_PIN_SEL>
//   <i> Shows which pin KBI1_P28 is mapped to
//     <0=> Disabled
//     <1=> PTH4<selection=PTH4_SIG_SEL,KBI1_P28>
//     <0=> Default
#define KBI1_P28_PIN_SEL     0
#if KBI1_P28_PIN_SEL == 1
#define KBI1_P28_GPIO        digitalIO_PTH4
#define KBI1_P28_FN          1
#endif

// Pin Mapping for KBI1_P29 signal
//   <o> KBI1_P29 [PTH5]<name=KBI1_P29_PIN_SEL>
//   <i> Shows which pin KBI1_P29 is mapped to
//     <0=> Disabled
//     <1=> PTH5<selection=PTH5_SIG_SEL,KBI1_P29>
//     <0=> Default
#define KBI1_P29_PIN_SEL     0
#if KBI1_P29_PIN_SEL == 1
#define KBI1_P29_GPIO        digitalIO_PTH5
#define KBI1_P29_FN          1
#endif

// Pin Mapping for KBI1_P30 signal
//   <o> KBI1_P30 [PTH6]<name=KBI1_P30_PIN_SEL>
//   <i> Shows which pin KBI1_P30 is mapped to
//     <0=> Disabled
//     <1=> PTH6<selection=PTH6_SIG_SEL,KBI1_P30>
//     <0=> Default
#define KBI1_P30_PIN_SEL     0
#if KBI1_P30_PIN_SEL == 1
#define KBI1_P30_GPIO        digitalIO_PTH6
#define KBI1_P30_FN          1
#endif

// Pin Mapping for KBI1_P31 signal
//   <o> KBI1_P31 [PTH7]<name=KBI1_P31_PIN_SEL>
//   <i> Shows which pin KBI1_P31 is mapped to
//     <0=> Disabled
//     <1=> PTH7<selection=PTH7_SIG_SEL,KBI1_P31>
//     <0=> Default
#define KBI1_P31_PIN_SEL     0
#if KBI1_P31_PIN_SEL == 1
#define KBI1_P31_GPIO        digitalIO_PTH7
#define KBI1_P31_FN          1
#endif

