podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKE06Z4.h
// Pin Mapping for PWT_IN0 signal
//   <o> PWT_IN0 [PTD5, PTE2]<name=PWT_IN0_PIN_SEL>
//   <i> Shows which pin PWT_IN0 is mapped to
//     <0=> Disabled
//     <1=> PTD5<selection=PTD5_SIG_SEL,PWT_IN0>
//     <2=> PTE2<selection=PTE2_SIG_SEL,PWT_IN0>
//     <0=> Default
#define PWT_IN0_PIN_SEL      0
#if PWT_IN0_PIN_SEL == 1
#define PWT_IN0_GPIO         digitalIO_PTD5
#define PWT_IN0_FN           2
#elif PWT_IN0_PIN_SEL == 2
#define PWT_IN0_GPIO         digitalIO_PTE2
#define PWT_IN0_FN           3
#endif

// Pin Mapping for PWT_IN1 signal
//   <o> PWT_IN1 [PTH7, PTB0]<name=PWT_IN1_PIN_SEL>
//   <i> Shows which pin PWT_IN1 is mapped to
//     <0=> Disabled
//     <1=> PTH7<selection=PTH7_SIG_SEL,PWT_IN1>
//     <2=> PTB0<selection=PTB0_SIG_SEL,PWT_IN1>
//     <0=> Default
#define PWT_IN1_PIN_SEL      0
#if PWT_IN1_PIN_SEL == 1
#define PWT_IN1_GPIO         digitalIO_PTH7
#define PWT_IN1_FN           2
#elif PWT_IN1_PIN_SEL == 2
#define PWT_IN1_GPIO         digitalIO_PTB0
#define PWT_IN1_FN           3
#endif

// </h>

// <h> Analogue Comparator (ACMP0)

// Pin Mapping for ACMP0_IN0 signal
//   <o> ACMP0_IN0 [PTA0]<name=ACMP0_IN0_PIN_SEL>
//   <i> Shows which pin ACMP0_IN0 is mapped to
//     <0=> Disabled
//     <1=> PTA0<selection=PTA0_SIG_SEL,ACMP0_IN0>
//     <0=> Default
#define ACMP0_IN0_PIN_SEL    0
#if ACMP0_IN0_PIN_SEL == 1
#define ACMP0_IN0_GPIO       digitalIO_PTA0
#define ACMP0_IN0_FN         4
#endif

// Pin Mapping for ACMP0_IN1 signal
//   <o> ACMP0_IN1 [PTA1]<name=ACMP0_IN1_PIN_SEL>
//   <i> Shows which pin ACMP0_IN1 is mapped to
//     <0=> Disabled
//     <1=> PTA1<selection=PTA1_SIG_SEL,ACMP0_IN1>
//     <0=> Default
#define ACMP0_IN1_PIN_SEL    0
#if ACMP0_IN1_PIN_SEL == 1
#define ACMP0_IN1_GPIO       digitalIO_PTA1
#define ACMP0_IN1_FN         4
#endif

// Pin Mapping for ACMP0_IN2 signal
//   <o> ACMP0_IN2 [PTC4]<name=ACMP0_IN2_PIN_SEL>
//   <i> Shows which pin ACMP0_IN2 is mapped to
//     <0=> Disabled
//     <1=> PTC4<selection=PTC4_SIG_SEL,ACMP0_IN2>
//     <0=> Default
#define ACMP0_IN2_PIN_SEL    0
#if ACMP0_IN2_PIN_SEL == 1
#define ACMP0_IN2_GPIO       digitalIO_PTC4
#define ACMP0_IN2_FN         4
#endif

// Pin Mapping for ACMP0_OUT signal
//   <o> ACMP0_OUT [PTA4]<name=ACMP0_OUT_PIN_SEL>
//   <i> Shows which pin ACMP0_OUT is mapped to
//     <0=> Disabled
//     <1=> PTA4<selection=PTA4_SIG_SEL,ACMP0_OUT>
//     <0=> Default
#define ACMP0_OUT_PIN_SEL    0
#if ACMP0_OUT_PIN_SEL == 1
#define ACMP0_OUT_GPIO       digitalIO_PTA4
#define ACMP0_OUT_FN         3
#endif

// </h>

// <h> Analogue Comparator (ACMP1)

// Pin Mapping for ACMP1_IN0 signal
//   <o> ACMP1_IN0 [PTA6]<name=ACMP1_IN0_PIN_SEL>
//   <i> Shows which pin ACMP1_IN0 is mapped to
//     <0=> Disabled
//     <1=> PTA6<selection=PTA6_SIG_SEL,ACMP1_IN0>
//     <0=> Default
#define ACMP1_IN0_PIN_SEL    0
#if ACMP1_IN0_PIN_SEL == 1
#define ACMP1_IN0_GPIO       digitalIO_PTA6
#define ACMP1_IN0_FN         3
#endif

// Pin Mapping for ACMP1_IN1 signal
//   <o> ACMP1_IN1 [PTA7]<name=ACMP1_IN1_PIN_SEL>
//   <i> Shows which pin ACMP1_IN1 is mapped to
//     <0=> Disabled
//     <1=> PTA7<selection=PTA7_SIG_SEL,ACMP1_IN1>
//     <0=> Default
#define ACMP1_IN1_PIN_SEL    0
#if ACMP1_IN1_PIN_SEL == 1
#define ACMP1_IN1_GPIO       digitalIO_PTA7
#define ACMP1_IN1_FN         3
#endif

// Pin Mapping for ACMP1_IN2 signal
//   <o> ACMP1_IN2 [PTB4]<name=ACMP1_IN2_PIN_SEL>
//   <i> Shows which pin ACMP1_IN2 is mapped to
//     <0=> Disabled
//     <1=> PTB4<selection=PTB4_SIG_SEL,ACMP1_IN2>
//     <0=> Default
#define ACMP1_IN2_PIN_SEL    0
#if ACMP1_IN2_PIN_SEL == 1
#define ACMP1_IN2_GPIO       digitalIO_PTB4
#define ACMP1_IN2_FN         4
#endif

// Pin Mapping for ACMP1_OUT signal
//   <o> ACMP1_OUT [PTB5]<name=ACMP1_OUT_PIN_SEL>
//   <i> Shows which pin ACMP1_OUT is mapped to
//     <0=> Disabled
//     <1=> PTB5<selection=PTB5_SIG_SEL,ACMP1_OUT>
//     <0=> Default
#define ACMP1_OUT_PIN_SEL    0
#if ACMP1_OUT_PIN_SEL == 1
#define ACMP1_OUT_GPIO       digitalIO_PTB5
#define ACMP1_OUT_FN         4
#endif

// </h>

// <h> Analogue to Digital (ADC0)

// Pin Mapping for ADC0_SE0 signal
//   <o> ADC0_SE0 [PTA0]<name=ADC0_SE0_PIN_SEL>
//   <i> Shows which pin ADC0_SE0 is mapped to
//     <0=> Disabled
//     <1=> PTA0 (reset default)<selection=PTA0_SIG_SEL,ADC0_SE0 (reset default)>
//     <2=> PTA0<selection=PTA0_SIG_SEL,ADC0_SE0>
//     <1=> Default
#define ADC0_SE0_PIN_SEL     1
#if ADC0_SE0_PIN_SEL == 2
#define ADC0_SE0_GPIO        digitalIO_PTA0
#define ADC0_SE0_FN          5
#endif

// Pin Mapping for ADC0_SE1 signal
//   <o> ADC0_SE1 [PTA1]<name=ADC0_SE1_PIN_SEL>
//   <i> Shows which pin ADC0_SE1 is mapped to
//     <0=> Disabled
//     <1=> PTA1 (reset default)<selection=PTA1_SIG_SEL,ADC0_SE1 (reset default)>
//     <2=> PTA1<selection=PTA1_SIG_SEL,ADC0_SE1>
//     <1=> Default
#define ADC0_SE1_PIN_SEL     1
#if ADC0_SE1_PIN_SEL == 2
#define ADC0_SE1_GPIO        digitalIO_PTA1
#define ADC0_SE1_FN          5
#endif

// Pin Mapping for ADC0_SE2 signal
//   <o> ADC0_SE2 [PTA6]<name=ADC0_SE2_PIN_SEL>
//   <i> Shows which pin ADC0_SE2 is mapped to
//     <0=> Disabled
//     <1=> PTA6 (reset default)<selection=PTA6_SIG_SEL,ADC0_SE2 (reset default)>
//     <2=> PTA6<selection=PTA6_SIG_SEL,ADC0_SE2>
//     <1=> Default
#define ADC0_SE2_PIN_SEL     1
#if ADC0_SE2_PIN_SEL == 2
#define ADC0_SE2_GPIO        digitalIO_PTA6
#define ADC0_SE2_FN          4
#endif

// Pin Mapping for ADC0_SE3 signal
//   <o> ADC0_SE3 [PTA7]<name=ADC0_SE3_PIN_SEL>
//   <i> Shows which pin ADC0_SE3 is mapped to
//     <0=> Disabled
//     <1=> PTA7 (reset default)<selection=PTA7_SIG_SEL,ADC0_SE3 (reset default)>
//     <2=> PTA7<selection=PTA7_SIG_SEL,ADC0_SE3>
//     <1=> Default
#define ADC0_SE3_PIN_SEL     1
#if ADC0_SE3_PIN_SEL == 2
#define ADC0_SE3_GPIO        digitalIO_PTA7
#define ADC0_SE3_FN          4
#endif

// Pin Mapping for ADC0_SE4 signal
//   <o> ADC0_SE4 [PTB0]<name=ADC0_SE4_PIN_SEL>
//   <i> Shows which pin ADC0_SE4 is mapped to
//     <0=> Disabled
//     <1=> PTB0 (reset default)<selection=PTB0_SIG_SEL,ADC0_SE4 (reset default)>
//     <2=> PTB0<selection=PTB0_SIG_SEL,ADC0_SE4>
//     <1=> Default
#define ADC0_SE4_PIN_SEL     1
#if ADC0_SE4_PIN_SEL == 2
#define ADC0_SE4_GPIO        digitalIO_PTB0
#define ADC0_SE4_FN          4
#endif

