podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKE06Z4.h
// Pin Mapping for ADC0_SE5 signal
//   <o> ADC0_SE5 [PTB1]<name=ADC0_SE5_PIN_SEL>
//   <i> Shows which pin ADC0_SE5 is mapped to
//     <0=> Disabled
//     <1=> PTB1 (reset default)<selection=PTB1_SIG_SEL,ADC0_SE5 (reset default)>
//     <2=> PTB1<selection=PTB1_SIG_SEL,ADC0_SE5>
//     <1=> Default
#define ADC0_SE5_PIN_SEL     1
#if ADC0_SE5_PIN_SEL == 2
#define ADC0_SE5_GPIO        digitalIO_PTB1
#define ADC0_SE5_FN          4
#endif

// Pin Mapping for ADC0_SE6 signal
//   <o> ADC0_SE6 [PTB2]<name=ADC0_SE6_PIN_SEL>
//   <i> Shows which pin ADC0_SE6 is mapped to
//     <0=> Disabled
//     <1=> PTB2 (reset default)<selection=PTB2_SIG_SEL,ADC0_SE6 (reset default)>
//     <2=> PTB2<selection=PTB2_SIG_SEL,ADC0_SE6>
//     <1=> Default
#define ADC0_SE6_PIN_SEL     1
#if ADC0_SE6_PIN_SEL == 2
#define ADC0_SE6_GPIO        digitalIO_PTB2
#define ADC0_SE6_FN          4
#endif

// Pin Mapping for ADC0_SE7 signal
//   <o> ADC0_SE7 [PTB3]<name=ADC0_SE7_PIN_SEL>
//   <i> Shows which pin ADC0_SE7 is mapped to
//     <0=> Disabled
//     <1=> PTB3 (reset default)<selection=PTB3_SIG_SEL,ADC0_SE7 (reset default)>
//     <2=> PTB3<selection=PTB3_SIG_SEL,ADC0_SE7>
//     <1=> Default
#define ADC0_SE7_PIN_SEL     1
#if ADC0_SE7_PIN_SEL == 2
#define ADC0_SE7_GPIO        digitalIO_PTB3
#define ADC0_SE7_FN          4
#endif

// Pin Mapping for ADC0_SE8 signal
//   <o> ADC0_SE8 [PTC0]<name=ADC0_SE8_PIN_SEL>
//   <i> Shows which pin ADC0_SE8 is mapped to
//     <0=> Disabled
//     <1=> PTC0 (reset default)<selection=PTC0_SIG_SEL,ADC0_SE8 (reset default)>
//     <2=> PTC0<selection=PTC0_SIG_SEL,ADC0_SE8>
//     <1=> Default
#define ADC0_SE8_PIN_SEL     1
#if ADC0_SE8_PIN_SEL == 2
#define ADC0_SE8_GPIO        digitalIO_PTC0
#define ADC0_SE8_FN          4
#endif

// Pin Mapping for ADC0_SE9 signal
//   <o> ADC0_SE9 [PTC1]<name=ADC0_SE9_PIN_SEL>
//   <i> Shows which pin ADC0_SE9 is mapped to
//     <0=> Disabled
//     <1=> PTC1 (reset default)<selection=PTC1_SIG_SEL,ADC0_SE9 (reset default)>
//     <2=> PTC1<selection=PTC1_SIG_SEL,ADC0_SE9>
//     <1=> Default
#define ADC0_SE9_PIN_SEL     1
#if ADC0_SE9_PIN_SEL == 2
#define ADC0_SE9_GPIO        digitalIO_PTC1
#define ADC0_SE9_FN          4
#endif

// Pin Mapping for ADC0_SE10 signal
//   <o> ADC0_SE10 [PTC2]<name=ADC0_SE10_PIN_SEL>
//   <i> Shows which pin ADC0_SE10 is mapped to
//     <0=> Disabled
//     <1=> PTC2 (reset default)<selection=PTC2_SIG_SEL,ADC0_SE10 (reset default)>
//     <2=> PTC2<selection=PTC2_SIG_SEL,ADC0_SE10>
//     <1=> Default
#define ADC0_SE10_PIN_SEL    1
#if ADC0_SE10_PIN_SEL == 2
#define ADC0_SE10_GPIO       digitalIO_PTC2
#define ADC0_SE10_FN         4
#endif

// Pin Mapping for ADC0_SE11 signal
//   <o> ADC0_SE11 [PTC3]<name=ADC0_SE11_PIN_SEL>
//   <i> Shows which pin ADC0_SE11 is mapped to
//     <0=> Disabled
//     <1=> PTC3 (reset default)<selection=PTC3_SIG_SEL,ADC0_SE11 (reset default)>
//     <2=> PTC3<selection=PTC3_SIG_SEL,ADC0_SE11>
//     <1=> Default
#define ADC0_SE11_PIN_SEL    1
#if ADC0_SE11_PIN_SEL == 2
#define ADC0_SE11_GPIO       digitalIO_PTC3
#define ADC0_SE11_FN         4
#endif

// Pin Mapping for ADC0_SE12 signal
//   <o> ADC0_SE12 [PTF4]<name=ADC0_SE12_PIN_SEL>
//   <i> Shows which pin ADC0_SE12 is mapped to
//     <0=> Disabled
//     <1=> PTF4 (reset default)<selection=PTF4_SIG_SEL,ADC0_SE12 (reset default)>
//     <2=> PTF4<selection=PTF4_SIG_SEL,ADC0_SE12>
//     <1=> Default
#define ADC0_SE12_PIN_SEL    1
#if ADC0_SE12_PIN_SEL == 2
#define ADC0_SE12_GPIO       digitalIO_PTF4
#define ADC0_SE12_FN         4
#endif

// Pin Mapping for ADC0_SE13 signal
//   <o> ADC0_SE13 [PTF5]<name=ADC0_SE13_PIN_SEL>
//   <i> Shows which pin ADC0_SE13 is mapped to
//     <0=> Disabled
//     <1=> PTF5 (reset default)<selection=PTF5_SIG_SEL,ADC0_SE13 (reset default)>
//     <2=> PTF5<selection=PTF5_SIG_SEL,ADC0_SE13>
//     <1=> Default
#define ADC0_SE13_PIN_SEL    1
#if ADC0_SE13_PIN_SEL == 2
#define ADC0_SE13_GPIO       digitalIO_PTF5
#define ADC0_SE13_FN         4
#endif

// Pin Mapping for ADC0_SE14 signal
//   <o> ADC0_SE14 [PTF6]<name=ADC0_SE14_PIN_SEL>
//   <i> Shows which pin ADC0_SE14 is mapped to
//     <0=> Disabled
//     <1=> PTF6 (reset default)<selection=PTF6_SIG_SEL,ADC0_SE14 (reset default)>
//     <2=> PTF6<selection=PTF6_SIG_SEL,ADC0_SE14>
//     <1=> Default
#define ADC0_SE14_PIN_SEL    1
#if ADC0_SE14_PIN_SEL == 2
#define ADC0_SE14_GPIO       digitalIO_PTF6
#define ADC0_SE14_FN         4
#endif

// Pin Mapping for ADC0_SE15 signal
//   <o> ADC0_SE15 [PTF7]<name=ADC0_SE15_PIN_SEL>
//   <i> Shows which pin ADC0_SE15 is mapped to
//     <0=> Disabled
//     <1=> PTF7 (reset default)<selection=PTF7_SIG_SEL,ADC0_SE15 (reset default)>
//     <2=> PTF7<selection=PTF7_SIG_SEL,ADC0_SE15>
//     <1=> Default
#define ADC0_SE15_PIN_SEL    1
#if ADC0_SE15_PIN_SEL == 2
#define ADC0_SE15_GPIO       digitalIO_PTF7
#define ADC0_SE15_FN         4
#endif

// </h>

// <h> CAN Bus (CAN0)

// Pin Mapping for CAN0_RX signal
//   <o> CAN0_RX [PTC6, PTH2]<name=CAN0_RX_PIN_SEL>
//   <i> Shows which pin CAN0_RX is mapped to
//     <0=> Disabled
//     <1=> PTC6<selection=PTC6_SIG_SEL,CAN0_RX>
//     <2=> PTH2<selection=PTH2_SIG_SEL,CAN0_RX>
//     <0=> Default
#define CAN0_RX_PIN_SEL      0
#if CAN0_RX_PIN_SEL == 1
#define CAN0_RX_GPIO         digitalIO_PTC6
#define CAN0_RX_FN           5
#elif CAN0_RX_PIN_SEL == 2
#define CAN0_RX_GPIO         digitalIO_PTH2
#define CAN0_RX_FN           5
#endif

// Pin Mapping for CAN0_TX signal
//   <o> CAN0_TX [PTC7, PTE7]<name=CAN0_TX_PIN_SEL>
//   <i> Shows which pin CAN0_TX is mapped to
//     <0=> Disabled
//     <1=> PTC7<selection=PTC7_SIG_SEL,CAN0_TX>
//     <2=> PTE7<selection=PTE7_SIG_SEL,CAN0_TX>
//     <0=> Default
#define CAN0_TX_PIN_SEL      0
#if CAN0_TX_PIN_SEL == 1
#define CAN0_TX_GPIO         digitalIO_PTC7
#define CAN0_TX_FN           5
#elif CAN0_TX_PIN_SEL == 2
#define CAN0_TX_GPIO         digitalIO_PTE7
#define CAN0_TX_FN           5
#endif

// </h>

// <h> Clock and Timing

// Pin Mapping for EXTAL signal
//   <o> EXTAL [PTB7]<name=EXTAL_PIN_SEL>
//   <i> Shows which pin EXTAL is mapped to
//     <0=> Disabled
//     <1=> PTB7 (reset default)<selection=PTB7_SIG_SEL,EXTAL (reset default)>
//     <2=> PTB7<selection=PTB7_SIG_SEL,EXTAL>
//     <1=> Default
#define EXTAL_PIN_SEL        1
#if EXTAL_PIN_SEL == 2
#define EXTAL_GPIO           digitalIO_PTB7
#define EXTAL_FN             6
#endif

// Pin Mapping for RTC_CLKOUT signal
//   <o> RTC_CLKOUT [PTC4, PTC5]<name=RTC_CLKOUT_PIN_SEL>
//   <i> Shows which pin RTC_CLKOUT is mapped to
//     <0=> Disabled
//     <1=> PTC4<selection=PTC4_SIG_SEL,RTC_CLKOUT>
//     <2=> PTC5<selection=PTC5_SIG_SEL,RTC_CLKOUT>
//     <0=> Default
#define RTC_CLKOUT_PIN_SEL   0
#if RTC_CLKOUT_PIN_SEL == 1
#define RTC_CLKOUT_GPIO      digitalIO_PTC4
#define RTC_CLKOUT_FN        2
#elif RTC_CLKOUT_PIN_SEL == 2
#define RTC_CLKOUT_GPIO      digitalIO_PTC5
#define RTC_CLKOUT_FN        5
#endif

// Pin Mapping for TCLK0 signal
//   <o> TCLK0 [PTA5]<name=TCLK0_PIN_SEL>
//   <i> Shows which pin TCLK0 is mapped to
//     <0=> Disabled
//     <1=> PTA5<selection=PTA5_SIG_SEL,TCLK0>
//     <0=> Default
#define TCLK0_PIN_SEL        0
#if TCLK0_PIN_SEL == 1
#define TCLK0_GPIO           digitalIO_PTA5
#define TCLK0_FN             3
#endif

// Pin Mapping for TCLK1 signal
//   <o> TCLK1 [PTE0]<name=TCLK1_PIN_SEL>
//   <i> Shows which pin TCLK1 is mapped to
//     <0=> Disabled
//     <1=> PTE0<selection=PTE0_SIG_SEL,TCLK1>
//     <0=> Default
#define TCLK1_PIN_SEL        0
#if TCLK1_PIN_SEL == 1
#define TCLK1_GPIO           digitalIO_PTE0
#define TCLK1_FN             3
#endif

// Pin Mapping for TCLK2 signal
//   <o> TCLK2 [PTE7]<name=TCLK2_PIN_SEL>
//   <i> Shows which pin TCLK2 is mapped to
//     <0=> Disabled
//     <1=> PTE7<selection=PTE7_SIG_SEL,TCLK2>
//     <0=> Default
#define TCLK2_PIN_SEL        0
#if TCLK2_PIN_SEL == 1
#define TCLK2_GPIO           digitalIO_PTE7
#define TCLK2_FN             2
#endif

// Pin Mapping for XTAL signal
//   <o> XTAL [PTB6]<name=XTAL_PIN_SEL>
//   <i> Shows which pin XTAL is mapped to
//     <0=> Disabled
//     <1=> PTB6 (reset default)<selection=PTB6_SIG_SEL,XTAL (reset default)>
//     <2=> PTB6<selection=PTB6_SIG_SEL,XTAL>
//     <1=> Default
#define XTAL_PIN_SEL         1
#if XTAL_PIN_SEL == 2
#define XTAL_GPIO            digitalIO_PTB6
#define XTAL_FN              6
#endif

