podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKE06Z4.h
// </h>

// <h> FlexTimer (FTM0)

// Pin Mapping for FTM0_CH0 signal
//   <o> FTM0_CH0 [PTA0, PTB2]<name=FTM0_CH0_PIN_SEL>
//   <i> Shows which pin FTM0_CH0 is mapped to
//     <0=> Disabled
//     <1=> PTA0<selection=PTA0_SIG_SEL,FTM0_CH0>
//     <2=> PTB2<selection=PTB2_SIG_SEL,FTM0_CH0>
//     <0=> Default
#define FTM0_CH0_PIN_SEL     0
#if FTM0_CH0_PIN_SEL == 1
#define FTM0_CH0_GPIO        digitalIO_PTA0
#define FTM0_CH0_FN          2
#elif FTM0_CH0_PIN_SEL == 2
#define FTM0_CH0_GPIO        digitalIO_PTB2
#define FTM0_CH0_FN          3
#endif

// Pin Mapping for FTM0_CH1 signal
//   <o> FTM0_CH1 [PTA1, PTB3]<name=FTM0_CH1_PIN_SEL>
//   <i> Shows which pin FTM0_CH1 is mapped to
//     <0=> Disabled
//     <1=> PTA1<selection=PTA1_SIG_SEL,FTM0_CH1>
//     <2=> PTB3<selection=PTB3_SIG_SEL,FTM0_CH1>
//     <0=> Default
#define FTM0_CH1_PIN_SEL     0
#if FTM0_CH1_PIN_SEL == 1
#define FTM0_CH1_GPIO        digitalIO_PTA1
#define FTM0_CH1_FN          2
#elif FTM0_CH1_PIN_SEL == 2
#define FTM0_CH1_GPIO        digitalIO_PTB3
#define FTM0_CH1_FN          3
#endif

// </h>

// <h> FlexTimer (FTM1)

// Pin Mapping for FTM1_CH0 signal
//   <o> FTM1_CH0 [PTC4, PTH2]<name=FTM1_CH0_PIN_SEL>
//   <i> Shows which pin FTM1_CH0 is mapped to
//     <0=> Disabled
//     <1=> PTC4<selection=PTC4_SIG_SEL,FTM1_CH0>
//     <2=> PTH2<selection=PTH2_SIG_SEL,FTM1_CH0>
//     <0=> Default
#define FTM1_CH0_PIN_SEL     0
#if FTM1_CH0_PIN_SEL == 1
#define FTM1_CH0_GPIO        digitalIO_PTC4
#define FTM1_CH0_FN          3
#elif FTM1_CH0_PIN_SEL == 2
#define FTM1_CH0_GPIO        digitalIO_PTH2
#define FTM1_CH0_FN          4
#endif

// Pin Mapping for FTM1_CH1 signal
//   <o> FTM1_CH1 [PTC5, PTE7]<name=FTM1_CH1_PIN_SEL>
//   <i> Shows which pin FTM1_CH1 is mapped to
//     <0=> Disabled
//     <1=> PTC5<selection=PTC5_SIG_SEL,FTM1_CH1>
//     <2=> PTE7<selection=PTE7_SIG_SEL,FTM1_CH1>
//     <0=> Default
#define FTM1_CH1_PIN_SEL     0
#if FTM1_CH1_PIN_SEL == 1
#define FTM1_CH1_GPIO        digitalIO_PTC5
#define FTM1_CH1_FN          3
#elif FTM1_CH1_PIN_SEL == 2
#define FTM1_CH1_GPIO        digitalIO_PTE7
#define FTM1_CH1_FN          4
#endif

// </h>

// <h> FlexTimer (FTM2)

// Pin Mapping for FTM2_CH0 signal
//   <o> FTM2_CH0 [PTC0, PTF0, PTH0]<name=FTM2_CH0_PIN_SEL>
//   <i> Shows which pin FTM2_CH0 is mapped to
//     <0=> Disabled
//     <1=> PTC0<selection=PTC0_SIG_SEL,FTM2_CH0>
//     <2=> PTF0<selection=PTF0_SIG_SEL,FTM2_CH0>
//     <3=> PTH0<selection=PTH0_SIG_SEL,FTM2_CH0>
//     <0=> Default
#define FTM2_CH0_PIN_SEL     0
#if FTM2_CH0_PIN_SEL == 1
#define FTM2_CH0_GPIO        digitalIO_PTC0
#define FTM2_CH0_FN          2
#elif FTM2_CH0_PIN_SEL == 2
#define FTM2_CH0_GPIO        digitalIO_PTF0
#define FTM2_CH0_FN          2
#elif FTM2_CH0_PIN_SEL == 3
#define FTM2_CH0_GPIO        digitalIO_PTH0
#define FTM2_CH0_FN          2
#endif

// Pin Mapping for FTM2_CH1 signal
//   <o> FTM2_CH1 [PTC1, PTF1, PTH1]<name=FTM2_CH1_PIN_SEL>
//   <i> Shows which pin FTM2_CH1 is mapped to
//     <0=> Disabled
//     <1=> PTC1<selection=PTC1_SIG_SEL,FTM2_CH1>
//     <2=> PTF1<selection=PTF1_SIG_SEL,FTM2_CH1>
//     <3=> PTH1<selection=PTH1_SIG_SEL,FTM2_CH1>
//     <0=> Default
#define FTM2_CH1_PIN_SEL     0
#if FTM2_CH1_PIN_SEL == 1
#define FTM2_CH1_GPIO        digitalIO_PTC1
#define FTM2_CH1_FN          2
#elif FTM2_CH1_PIN_SEL == 2
#define FTM2_CH1_GPIO        digitalIO_PTF1
#define FTM2_CH1_FN          2
#elif FTM2_CH1_PIN_SEL == 3
#define FTM2_CH1_GPIO        digitalIO_PTH1
#define FTM2_CH1_FN          2
#endif

// Pin Mapping for FTM2_CH2 signal
//   <o> FTM2_CH2 [PTC2, PTD0, PTG4]<name=FTM2_CH2_PIN_SEL>
//   <i> Shows which pin FTM2_CH2 is mapped to
//     <0=> Disabled
//     <1=> PTC2<selection=PTC2_SIG_SEL,FTM2_CH2>
//     <2=> PTD0<selection=PTD0_SIG_SEL,FTM2_CH2>
//     <3=> PTG4<selection=PTG4_SIG_SEL,FTM2_CH2>
//     <0=> Default
#define FTM2_CH2_PIN_SEL     0
#if FTM2_CH2_PIN_SEL == 1
#define FTM2_CH2_GPIO        digitalIO_PTC2
#define FTM2_CH2_FN          2
#elif FTM2_CH2_PIN_SEL == 2
#define FTM2_CH2_GPIO        digitalIO_PTD0
#define FTM2_CH2_FN          2
#elif FTM2_CH2_PIN_SEL == 3
#define FTM2_CH2_GPIO        digitalIO_PTG4
#define FTM2_CH2_FN          2
#endif

// Pin Mapping for FTM2_CH3 signal
//   <o> FTM2_CH3 [PTC3, PTD1, PTG5]<name=FTM2_CH3_PIN_SEL>
//   <i> Shows which pin FTM2_CH3 is mapped to
//     <0=> Disabled
//     <1=> PTC3<selection=PTC3_SIG_SEL,FTM2_CH3>
//     <2=> PTD1<selection=PTD1_SIG_SEL,FTM2_CH3>
//     <3=> PTG5 (Alias:LED_RED)<selection=PTG5_SIG_SEL,FTM2_CH3>
//     <0=> Default
#define FTM2_CH3_PIN_SEL     0
#if FTM2_CH3_PIN_SEL == 1
#define FTM2_CH3_GPIO        digitalIO_PTC3
#define FTM2_CH3_FN          2
#elif FTM2_CH3_PIN_SEL == 2
#define FTM2_CH3_GPIO        digitalIO_PTD1
#define FTM2_CH3_FN          2
#elif FTM2_CH3_PIN_SEL == 3
#define FTM2_CH3_GPIO        digitalIO_PTG5
#define FTM2_CH3_FN          2
#endif

// Pin Mapping for FTM2_CH4 signal
//   <o> FTM2_CH4 [PTB4, PTG6]<name=FTM2_CH4_PIN_SEL>
//   <i> Shows which pin FTM2_CH4 is mapped to
//     <0=> Disabled
//     <1=> PTB4<selection=PTB4_SIG_SEL,FTM2_CH4>
//     <2=> PTG6 (Alias:LED_GREEN)<selection=PTG6_SIG_SEL,FTM2_CH4>
//     <0=> Default
#define FTM2_CH4_PIN_SEL     0
#if FTM2_CH4_PIN_SEL == 1
#define FTM2_CH4_GPIO        digitalIO_PTB4
#define FTM2_CH4_FN          2
#elif FTM2_CH4_PIN_SEL == 2
#define FTM2_CH4_GPIO        digitalIO_PTG6
#define FTM2_CH4_FN          2
#endif

// Pin Mapping for FTM2_CH5 signal
//   <o> FTM2_CH5 [PTB5, PTG7]<name=FTM2_CH5_PIN_SEL>
//   <i> Shows which pin FTM2_CH5 is mapped to
//     <0=> Disabled
//     <1=> PTB5<selection=PTB5_SIG_SEL,FTM2_CH5>
//     <2=> PTG7 (Alias:LED_BLUE)<selection=PTG7_SIG_SEL,FTM2_CH5>
//     <0=> Default
#define FTM2_CH5_PIN_SEL     0
#if FTM2_CH5_PIN_SEL == 1
#define FTM2_CH5_GPIO        digitalIO_PTB5
#define FTM2_CH5_FN          2
#elif FTM2_CH5_PIN_SEL == 2
#define FTM2_CH5_GPIO        digitalIO_PTG7
#define FTM2_CH5_FN          2
#endif

// Pin Mapping for FTM2_FLT1 signal
//   <o> FTM2_FLT1 [PTA6]<name=FTM2_FLT1_PIN_SEL>
//   <i> Shows which pin FTM2_FLT1 is mapped to
//     <0=> Disabled
//     <1=> PTA6<selection=PTA6_SIG_SEL,FTM2_FLT1>
//     <0=> Default
#define FTM2_FLT1_PIN_SEL    0
#if FTM2_FLT1_PIN_SEL == 1
#define FTM2_FLT1_GPIO       digitalIO_PTA6
#define FTM2_FLT1_FN         2
#endif

// Pin Mapping for FTM2_FLT2 signal
//   <o> FTM2_FLT2 [PTA7]<name=FTM2_FLT2_PIN_SEL>
//   <i> Shows which pin FTM2_FLT2 is mapped to
//     <0=> Disabled
//     <1=> PTA7<selection=PTA7_SIG_SEL,FTM2_FLT2>
//     <0=> Default
#define FTM2_FLT2_PIN_SEL    0
#if FTM2_FLT2_PIN_SEL == 1
#define FTM2_FLT2_GPIO       digitalIO_PTA7
#define FTM2_FLT2_FN         2
#endif

