podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKE06Z4.h
// </h>

// <h> General Purpose I/O (GPIOA)

// Pin Mapping for GPIOA_0 signal
//   <o> GPIOA_0 [PTA0]<name=GPIOA_0_PIN_SEL>
//   <i> Shows which pin GPIOA_0 is mapped to
//     <0=> Disabled
//     <1=> PTA0<selection=PTA0_SIG_SEL,GPIOA_0>
//     <0=> Default
#define GPIOA_0_PIN_SEL      0
#if GPIOA_0_PIN_SEL == 1
#define GPIOA_0_GPIO         digitalIO_PTA0
#define GPIOA_0_FN           0
#endif

// Pin Mapping for GPIOA_1 signal
//   <o> GPIOA_1 [PTA1]<name=GPIOA_1_PIN_SEL>
//   <i> Shows which pin GPIOA_1 is mapped to
//     <0=> Disabled
//     <1=> PTA1<selection=PTA1_SIG_SEL,GPIOA_1>
//     <0=> Default
#define GPIOA_1_PIN_SEL      0
#if GPIOA_1_PIN_SEL == 1
#define GPIOA_1_GPIO         digitalIO_PTA1
#define GPIOA_1_FN           0
#endif

// Pin Mapping for GPIOA_2 signal
//   <o> GPIOA_2 [PTA2]<name=GPIOA_2_PIN_SEL>
//   <i> Shows which pin GPIOA_2 is mapped to
//     <0=> Disabled
//     <1=> PTA2<selection=PTA2_SIG_SEL,GPIOA_2>
//     <0=> Default
#define GPIOA_2_PIN_SEL      0
#if GPIOA_2_PIN_SEL == 1
#define GPIOA_2_GPIO         digitalIO_PTA2
#define GPIOA_2_FN           0
#endif

// Pin Mapping for GPIOA_3 signal
//   <o> GPIOA_3 [PTA3]<name=GPIOA_3_PIN_SEL>
//   <i> Shows which pin GPIOA_3 is mapped to
//     <0=> Disabled
//     <1=> PTA3<selection=PTA3_SIG_SEL,GPIOA_3>
//     <0=> Default
#define GPIOA_3_PIN_SEL      0
#if GPIOA_3_PIN_SEL == 1
#define GPIOA_3_GPIO         digitalIO_PTA3
#define GPIOA_3_FN           0
#endif

// Pin Mapping for GPIOA_4 signal
//   <o> GPIOA_4 [PTA4]<name=GPIOA_4_PIN_SEL>
//   <i> Shows which pin GPIOA_4 is mapped to
//     <0=> Disabled
//     <1=> PTA4<selection=PTA4_SIG_SEL,GPIOA_4>
//     <0=> Default
#define GPIOA_4_PIN_SEL      0
#if GPIOA_4_PIN_SEL == 1
#define GPIOA_4_GPIO         digitalIO_PTA4
#define GPIOA_4_FN           0
#endif

// Pin Mapping for GPIOA_5 signal
//   <o> GPIOA_5 [PTA5]<name=GPIOA_5_PIN_SEL>
//   <i> Shows which pin GPIOA_5 is mapped to
//     <0=> Disabled
//     <1=> PTA5<selection=PTA5_SIG_SEL,GPIOA_5>
//     <0=> Default
#define GPIOA_5_PIN_SEL      0
#if GPIOA_5_PIN_SEL == 1
#define GPIOA_5_GPIO         digitalIO_PTA5
#define GPIOA_5_FN           0
#endif

// Pin Mapping for GPIOA_6 signal
//   <o> GPIOA_6 [PTA6]<name=GPIOA_6_PIN_SEL>
//   <i> Shows which pin GPIOA_6 is mapped to
//     <0=> Disabled
//     <1=> PTA6<selection=PTA6_SIG_SEL,GPIOA_6>
//     <0=> Default
#define GPIOA_6_PIN_SEL      0
#if GPIOA_6_PIN_SEL == 1
#define GPIOA_6_GPIO         digitalIO_PTA6
#define GPIOA_6_FN           0
#endif

// Pin Mapping for GPIOA_7 signal
//   <o> GPIOA_7 [PTA7]<name=GPIOA_7_PIN_SEL>
//   <i> Shows which pin GPIOA_7 is mapped to
//     <0=> Disabled
//     <1=> PTA7<selection=PTA7_SIG_SEL,GPIOA_7>
//     <0=> Default
#define GPIOA_7_PIN_SEL      0
#if GPIOA_7_PIN_SEL == 1
#define GPIOA_7_GPIO         digitalIO_PTA7
#define GPIOA_7_FN           0
#endif

// Pin Mapping for GPIOA_8 signal
//   <o> GPIOA_8 [PTB0]<name=GPIOA_8_PIN_SEL>
//   <i> Shows which pin GPIOA_8 is mapped to
//     <0=> Disabled
//     <1=> PTB0<selection=PTB0_SIG_SEL,GPIOA_8>
//     <0=> Default
#define GPIOA_8_PIN_SEL      0
#if GPIOA_8_PIN_SEL == 1
#define GPIOA_8_GPIO         digitalIO_PTB0
#define GPIOA_8_FN           0
#endif

// Pin Mapping for GPIOA_9 signal
//   <o> GPIOA_9 [PTB1]<name=GPIOA_9_PIN_SEL>
//   <i> Shows which pin GPIOA_9 is mapped to
//     <0=> Disabled
//     <1=> PTB1<selection=PTB1_SIG_SEL,GPIOA_9>
//     <0=> Default
#define GPIOA_9_PIN_SEL      0
#if GPIOA_9_PIN_SEL == 1
#define GPIOA_9_GPIO         digitalIO_PTB1
#define GPIOA_9_FN           0
#endif

// Pin Mapping for GPIOA_10 signal
//   <o> GPIOA_10 [PTB2]<name=GPIOA_10_PIN_SEL>
//   <i> Shows which pin GPIOA_10 is mapped to
//     <0=> Disabled
//     <1=> PTB2<selection=PTB2_SIG_SEL,GPIOA_10>
//     <0=> Default
#define GPIOA_10_PIN_SEL     0
#if GPIOA_10_PIN_SEL == 1
#define GPIOA_10_GPIO        digitalIO_PTB2
#define GPIOA_10_FN          0
#endif

// Pin Mapping for GPIOA_11 signal
//   <o> GPIOA_11 [PTB3]<name=GPIOA_11_PIN_SEL>
//   <i> Shows which pin GPIOA_11 is mapped to
//     <0=> Disabled
//     <1=> PTB3<selection=PTB3_SIG_SEL,GPIOA_11>
//     <0=> Default
#define GPIOA_11_PIN_SEL     0
#if GPIOA_11_PIN_SEL == 1
#define GPIOA_11_GPIO        digitalIO_PTB3
#define GPIOA_11_FN          0
#endif

// Pin Mapping for GPIOA_12 signal
//   <o> GPIOA_12 [PTB4]<name=GPIOA_12_PIN_SEL>
//   <i> Shows which pin GPIOA_12 is mapped to
//     <0=> Disabled
//     <1=> PTB4<selection=PTB4_SIG_SEL,GPIOA_12>
//     <0=> Default
#define GPIOA_12_PIN_SEL     0
#if GPIOA_12_PIN_SEL == 1
#define GPIOA_12_GPIO        digitalIO_PTB4
#define GPIOA_12_FN          0
#endif

// Pin Mapping for GPIOA_13 signal
//   <o> GPIOA_13 [PTB5]<name=GPIOA_13_PIN_SEL>
//   <i> Shows which pin GPIOA_13 is mapped to
//     <0=> Disabled
//     <1=> PTB5<selection=PTB5_SIG_SEL,GPIOA_13>
//     <0=> Default
#define GPIOA_13_PIN_SEL     0
#if GPIOA_13_PIN_SEL == 1
#define GPIOA_13_GPIO        digitalIO_PTB5
#define GPIOA_13_FN          0
#endif

// Pin Mapping for GPIOA_14 signal
//   <o> GPIOA_14 [PTB6]<name=GPIOA_14_PIN_SEL>
//   <i> Shows which pin GPIOA_14 is mapped to
//     <0=> Disabled
//     <1=> PTB6<selection=PTB6_SIG_SEL,GPIOA_14>
//     <0=> Default
#define GPIOA_14_PIN_SEL     0
#if GPIOA_14_PIN_SEL == 1
#define GPIOA_14_GPIO        digitalIO_PTB6
#define GPIOA_14_FN          0
#endif

// Pin Mapping for GPIOA_15 signal
//   <o> GPIOA_15 [PTB7]<name=GPIOA_15_PIN_SEL>
//   <i> Shows which pin GPIOA_15 is mapped to
//     <0=> Disabled
//     <1=> PTB7<selection=PTB7_SIG_SEL,GPIOA_15>
//     <0=> Default
#define GPIOA_15_PIN_SEL     0
#if GPIOA_15_PIN_SEL == 1
#define GPIOA_15_GPIO        digitalIO_PTB7
#define GPIOA_15_FN          0
#endif

// Pin Mapping for GPIOA_16 signal
//   <o> GPIOA_16 [PTC0]<name=GPIOA_16_PIN_SEL>
//   <i> Shows which pin GPIOA_16 is mapped to
//     <0=> Disabled
//     <1=> PTC0<selection=PTC0_SIG_SEL,GPIOA_16>
//     <0=> Default
#define GPIOA_16_PIN_SEL     0
#if GPIOA_16_PIN_SEL == 1
#define GPIOA_16_GPIO        digitalIO_PTC0
#define GPIOA_16_FN          0
#endif

// Pin Mapping for GPIOA_17 signal
//   <o> GPIOA_17 [PTC1]<name=GPIOA_17_PIN_SEL>
//   <i> Shows which pin GPIOA_17 is mapped to
//     <0=> Disabled
//     <1=> PTC1<selection=PTC1_SIG_SEL,GPIOA_17>
//     <0=> Default
#define GPIOA_17_PIN_SEL     0
#if GPIOA_17_PIN_SEL == 1
#define GPIOA_17_GPIO        digitalIO_PTC1
#define GPIOA_17_FN          0
#endif

// Pin Mapping for GPIOA_18 signal
//   <o> GPIOA_18 [PTC2]<name=GPIOA_18_PIN_SEL>
//   <i> Shows which pin GPIOA_18 is mapped to
//     <0=> Disabled
//     <1=> PTC2<selection=PTC2_SIG_SEL,GPIOA_18>
//     <0=> Default
#define GPIOA_18_PIN_SEL     0
#if GPIOA_18_PIN_SEL == 1
#define GPIOA_18_GPIO        digitalIO_PTC2
#define GPIOA_18_FN          0
#endif

// Pin Mapping for GPIOA_19 signal
//   <o> GPIOA_19 [PTC3]<name=GPIOA_19_PIN_SEL>
//   <i> Shows which pin GPIOA_19 is mapped to
//     <0=> Disabled
//     <1=> PTC3<selection=PTC3_SIG_SEL,GPIOA_19>
//     <0=> Default
#define GPIOA_19_PIN_SEL     0
#if GPIOA_19_PIN_SEL == 1
#define GPIOA_19_GPIO        digitalIO_PTC3
#define GPIOA_19_FN          0
#endif

// Pin Mapping for GPIOA_20 signal
//   <o> GPIOA_20 [PTC4]<name=GPIOA_20_PIN_SEL>
//   <i> Shows which pin GPIOA_20 is mapped to
//     <0=> Disabled
//     <1=> PTC4<selection=PTC4_SIG_SEL,GPIOA_20>
//     <0=> Default
#define GPIOA_20_PIN_SEL     0
#if GPIOA_20_PIN_SEL == 1
#define GPIOA_20_GPIO        digitalIO_PTC4
#define GPIOA_20_FN          0
#endif

// Pin Mapping for GPIOA_21 signal
//   <o> GPIOA_21 [PTC5]<name=GPIOA_21_PIN_SEL>
//   <i> Shows which pin GPIOA_21 is mapped to
//     <0=> Disabled
//     <1=> PTC5<selection=PTC5_SIG_SEL,GPIOA_21>
//     <0=> Default
#define GPIOA_21_PIN_SEL     0
#if GPIOA_21_PIN_SEL == 1
#define GPIOA_21_GPIO        digitalIO_PTC5
#define GPIOA_21_FN          0
#endif

