podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKE06Z4.h
// Pin Mapping for GPIOA_22 signal
//   <o> GPIOA_22 [PTC6]<name=GPIOA_22_PIN_SEL>
//   <i> Shows which pin GPIOA_22 is mapped to
//     <0=> Disabled
//     <1=> PTC6<selection=PTC6_SIG_SEL,GPIOA_22>
//     <0=> Default
#define GPIOA_22_PIN_SEL     0
#if GPIOA_22_PIN_SEL == 1
#define GPIOA_22_GPIO        digitalIO_PTC6
#define GPIOA_22_FN          0
#endif

// Pin Mapping for GPIOA_23 signal
//   <o> GPIOA_23 [PTC7]<name=GPIOA_23_PIN_SEL>
//   <i> Shows which pin GPIOA_23 is mapped to
//     <0=> Disabled
//     <1=> PTC7<selection=PTC7_SIG_SEL,GPIOA_23>
//     <0=> Default
#define GPIOA_23_PIN_SEL     0
#if GPIOA_23_PIN_SEL == 1
#define GPIOA_23_GPIO        digitalIO_PTC7
#define GPIOA_23_FN          0
#endif

// Pin Mapping for GPIOA_24 signal
//   <o> GPIOA_24 [PTD0]<name=GPIOA_24_PIN_SEL>
//   <i> Shows which pin GPIOA_24 is mapped to
//     <0=> Disabled
//     <1=> PTD0<selection=PTD0_SIG_SEL,GPIOA_24>
//     <0=> Default
#define GPIOA_24_PIN_SEL     0
#if GPIOA_24_PIN_SEL == 1
#define GPIOA_24_GPIO        digitalIO_PTD0
#define GPIOA_24_FN          0
#endif

// Pin Mapping for GPIOA_25 signal
//   <o> GPIOA_25 [PTD1]<name=GPIOA_25_PIN_SEL>
//   <i> Shows which pin GPIOA_25 is mapped to
//     <0=> Disabled
//     <1=> PTD1<selection=PTD1_SIG_SEL,GPIOA_25>
//     <0=> Default
#define GPIOA_25_PIN_SEL     0
#if GPIOA_25_PIN_SEL == 1
#define GPIOA_25_GPIO        digitalIO_PTD1
#define GPIOA_25_FN          0
#endif

// Pin Mapping for GPIOA_26 signal
//   <o> GPIOA_26 [PTD2]<name=GPIOA_26_PIN_SEL>
//   <i> Shows which pin GPIOA_26 is mapped to
//     <0=> Disabled
//     <1=> PTD2<selection=PTD2_SIG_SEL,GPIOA_26>
//     <0=> Default
#define GPIOA_26_PIN_SEL     0
#if GPIOA_26_PIN_SEL == 1
#define GPIOA_26_GPIO        digitalIO_PTD2
#define GPIOA_26_FN          0
#endif

// Pin Mapping for GPIOA_27 signal
//   <o> GPIOA_27 [PTD3]<name=GPIOA_27_PIN_SEL>
//   <i> Shows which pin GPIOA_27 is mapped to
//     <0=> Disabled
//     <1=> PTD3<selection=PTD3_SIG_SEL,GPIOA_27>
//     <0=> Default
#define GPIOA_27_PIN_SEL     0
#if GPIOA_27_PIN_SEL == 1
#define GPIOA_27_GPIO        digitalIO_PTD3
#define GPIOA_27_FN          0
#endif

// Pin Mapping for GPIOA_28 signal
//   <o> GPIOA_28 [PTD4]<name=GPIOA_28_PIN_SEL>
//   <i> Shows which pin GPIOA_28 is mapped to
//     <0=> Disabled
//     <1=> PTD4<selection=PTD4_SIG_SEL,GPIOA_28>
//     <0=> Default
#define GPIOA_28_PIN_SEL     0
#if GPIOA_28_PIN_SEL == 1
#define GPIOA_28_GPIO        digitalIO_PTD4
#define GPIOA_28_FN          0
#endif

// Pin Mapping for GPIOA_29 signal
//   <o> GPIOA_29 [PTD5]<name=GPIOA_29_PIN_SEL>
//   <i> Shows which pin GPIOA_29 is mapped to
//     <0=> Disabled
//     <1=> PTD5<selection=PTD5_SIG_SEL,GPIOA_29>
//     <0=> Default
#define GPIOA_29_PIN_SEL     0
#if GPIOA_29_PIN_SEL == 1
#define GPIOA_29_GPIO        digitalIO_PTD5
#define GPIOA_29_FN          0
#endif

// Pin Mapping for GPIOA_30 signal
//   <o> GPIOA_30 [PTD6]<name=GPIOA_30_PIN_SEL>
//   <i> Shows which pin GPIOA_30 is mapped to
//     <0=> Disabled
//     <1=> PTD6<selection=PTD6_SIG_SEL,GPIOA_30>
//     <0=> Default
#define GPIOA_30_PIN_SEL     0
#if GPIOA_30_PIN_SEL == 1
#define GPIOA_30_GPIO        digitalIO_PTD6
#define GPIOA_30_FN          0
#endif

// Pin Mapping for GPIOA_31 signal
//   <o> GPIOA_31 [PTD7]<name=GPIOA_31_PIN_SEL>
//   <i> Shows which pin GPIOA_31 is mapped to
//     <0=> Disabled
//     <1=> PTD7<selection=PTD7_SIG_SEL,GPIOA_31>
//     <0=> Default
#define GPIOA_31_PIN_SEL     0
#if GPIOA_31_PIN_SEL == 1
#define GPIOA_31_GPIO        digitalIO_PTD7
#define GPIOA_31_FN          0
#endif

// </h>

// <h> General Purpose I/O (GPIOB)

// Pin Mapping for GPIOB_0 signal
//   <o> GPIOB_0 [PTE0]<name=GPIOB_0_PIN_SEL>
//   <i> Shows which pin GPIOB_0 is mapped to
//     <0=> Disabled
//     <1=> PTE0<selection=PTE0_SIG_SEL,GPIOB_0>
//     <0=> Default
#define GPIOB_0_PIN_SEL      0
#if GPIOB_0_PIN_SEL == 1
#define GPIOB_0_GPIO         digitalIO_PTE0
#define GPIOB_0_FN           0
#endif

// Pin Mapping for GPIOB_1 signal
//   <o> GPIOB_1 [PTE1]<name=GPIOB_1_PIN_SEL>
//   <i> Shows which pin GPIOB_1 is mapped to
//     <0=> Disabled
//     <1=> PTE1<selection=PTE1_SIG_SEL,GPIOB_1>
//     <0=> Default
#define GPIOB_1_PIN_SEL      0
#if GPIOB_1_PIN_SEL == 1
#define GPIOB_1_GPIO         digitalIO_PTE1
#define GPIOB_1_FN           0
#endif

// Pin Mapping for GPIOB_2 signal
//   <o> GPIOB_2 [PTE2]<name=GPIOB_2_PIN_SEL>
//   <i> Shows which pin GPIOB_2 is mapped to
//     <0=> Disabled
//     <1=> PTE2<selection=PTE2_SIG_SEL,GPIOB_2>
//     <0=> Default
#define GPIOB_2_PIN_SEL      0
#if GPIOB_2_PIN_SEL == 1
#define GPIOB_2_GPIO         digitalIO_PTE2
#define GPIOB_2_FN           0
#endif

// Pin Mapping for GPIOB_3 signal
//   <o> GPIOB_3 [PTE3]<name=GPIOB_3_PIN_SEL>
//   <i> Shows which pin GPIOB_3 is mapped to
//     <0=> Disabled
//     <1=> PTE3<selection=PTE3_SIG_SEL,GPIOB_3>
//     <0=> Default
#define GPIOB_3_PIN_SEL      0
#if GPIOB_3_PIN_SEL == 1
#define GPIOB_3_GPIO         digitalIO_PTE3
#define GPIOB_3_FN           0
#endif

// Pin Mapping for GPIOB_4 signal
//   <o> GPIOB_4 [PTE4]<name=GPIOB_4_PIN_SEL>
//   <i> Shows which pin GPIOB_4 is mapped to
//     <0=> Disabled
//     <1=> PTE4<selection=PTE4_SIG_SEL,GPIOB_4>
//     <0=> Default
#define GPIOB_4_PIN_SEL      0
#if GPIOB_4_PIN_SEL == 1
#define GPIOB_4_GPIO         digitalIO_PTE4
#define GPIOB_4_FN           0
#endif

// Pin Mapping for GPIOB_5 signal
//   <o> GPIOB_5 [PTE5]<name=GPIOB_5_PIN_SEL>
//   <i> Shows which pin GPIOB_5 is mapped to
//     <0=> Disabled
//     <1=> PTE5<selection=PTE5_SIG_SEL,GPIOB_5>
//     <0=> Default
#define GPIOB_5_PIN_SEL      0
#if GPIOB_5_PIN_SEL == 1
#define GPIOB_5_GPIO         digitalIO_PTE5
#define GPIOB_5_FN           0
#endif

// Pin Mapping for GPIOB_6 signal
//   <o> GPIOB_6 [PTE6]<name=GPIOB_6_PIN_SEL>
//   <i> Shows which pin GPIOB_6 is mapped to
//     <0=> Disabled
//     <1=> PTE6<selection=PTE6_SIG_SEL,GPIOB_6>
//     <0=> Default
#define GPIOB_6_PIN_SEL      0
#if GPIOB_6_PIN_SEL == 1
#define GPIOB_6_GPIO         digitalIO_PTE6
#define GPIOB_6_FN           0
#endif

// Pin Mapping for GPIOB_7 signal
//   <o> GPIOB_7 [PTE7]<name=GPIOB_7_PIN_SEL>
//   <i> Shows which pin GPIOB_7 is mapped to
//     <0=> Disabled
//     <1=> PTE7<selection=PTE7_SIG_SEL,GPIOB_7>
//     <0=> Default
#define GPIOB_7_PIN_SEL      0
#if GPIOB_7_PIN_SEL == 1
#define GPIOB_7_GPIO         digitalIO_PTE7
#define GPIOB_7_FN           0
#endif

// Pin Mapping for GPIOB_8 signal
//   <o> GPIOB_8 [PTF0]<name=GPIOB_8_PIN_SEL>
//   <i> Shows which pin GPIOB_8 is mapped to
//     <0=> Disabled
//     <1=> PTF0<selection=PTF0_SIG_SEL,GPIOB_8>
//     <0=> Default
#define GPIOB_8_PIN_SEL      0
#if GPIOB_8_PIN_SEL == 1
#define GPIOB_8_GPIO         digitalIO_PTF0
#define GPIOB_8_FN           0
#endif

// Pin Mapping for GPIOB_9 signal
//   <o> GPIOB_9 [PTF1]<name=GPIOB_9_PIN_SEL>
//   <i> Shows which pin GPIOB_9 is mapped to
//     <0=> Disabled
//     <1=> PTF1<selection=PTF1_SIG_SEL,GPIOB_9>
//     <0=> Default
#define GPIOB_9_PIN_SEL      0
#if GPIOB_9_PIN_SEL == 1
#define GPIOB_9_GPIO         digitalIO_PTF1
#define GPIOB_9_FN           0
#endif

// Pin Mapping for GPIOB_10 signal
//   <o> GPIOB_10 [PTF2]<name=GPIOB_10_PIN_SEL>
//   <i> Shows which pin GPIOB_10 is mapped to
//     <0=> Disabled
//     <1=> PTF2<selection=PTF2_SIG_SEL,GPIOB_10>
//     <0=> Default
#define GPIOB_10_PIN_SEL     0
#if GPIOB_10_PIN_SEL == 1
#define GPIOB_10_GPIO        digitalIO_PTF2
#define GPIOB_10_FN          0
#endif

// Pin Mapping for GPIOB_11 signal
//   <o> GPIOB_11 [PTF3]<name=GPIOB_11_PIN_SEL>
//   <i> Shows which pin GPIOB_11 is mapped to
//     <0=> Disabled
//     <1=> PTF3<selection=PTF3_SIG_SEL,GPIOB_11>
//     <0=> Default
#define GPIOB_11_PIN_SEL     0
#if GPIOB_11_PIN_SEL == 1
#define GPIOB_11_GPIO        digitalIO_PTF3
#define GPIOB_11_FN          0
#endif

