podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKE06Z4.h
// Pin Mapping for GPIOB_12 signal
//   <o> GPIOB_12 [PTF4]<name=GPIOB_12_PIN_SEL>
//   <i> Shows which pin GPIOB_12 is mapped to
//     <0=> Disabled
//     <1=> PTF4<selection=PTF4_SIG_SEL,GPIOB_12>
//     <0=> Default
#define GPIOB_12_PIN_SEL     0
#if GPIOB_12_PIN_SEL == 1
#define GPIOB_12_GPIO        digitalIO_PTF4
#define GPIOB_12_FN          0
#endif

// Pin Mapping for GPIOB_13 signal
//   <o> GPIOB_13 [PTF5]<name=GPIOB_13_PIN_SEL>
//   <i> Shows which pin GPIOB_13 is mapped to
//     <0=> Disabled
//     <1=> PTF5<selection=PTF5_SIG_SEL,GPIOB_13>
//     <0=> Default
#define GPIOB_13_PIN_SEL     0
#if GPIOB_13_PIN_SEL == 1
#define GPIOB_13_GPIO        digitalIO_PTF5
#define GPIOB_13_FN          0
#endif

// Pin Mapping for GPIOB_14 signal
//   <o> GPIOB_14 [PTF6]<name=GPIOB_14_PIN_SEL>
//   <i> Shows which pin GPIOB_14 is mapped to
//     <0=> Disabled
//     <1=> PTF6<selection=PTF6_SIG_SEL,GPIOB_14>
//     <0=> Default
#define GPIOB_14_PIN_SEL     0
#if GPIOB_14_PIN_SEL == 1
#define GPIOB_14_GPIO        digitalIO_PTF6
#define GPIOB_14_FN          0
#endif

// Pin Mapping for GPIOB_15 signal
//   <o> GPIOB_15 [PTF7]<name=GPIOB_15_PIN_SEL>
//   <i> Shows which pin GPIOB_15 is mapped to
//     <0=> Disabled
//     <1=> PTF7<selection=PTF7_SIG_SEL,GPIOB_15>
//     <0=> Default
#define GPIOB_15_PIN_SEL     0
#if GPIOB_15_PIN_SEL == 1
#define GPIOB_15_GPIO        digitalIO_PTF7
#define GPIOB_15_FN          0
#endif

// Pin Mapping for GPIOB_16 signal
//   <o> GPIOB_16 [PTG0]<name=GPIOB_16_PIN_SEL>
//   <i> Shows which pin GPIOB_16 is mapped to
//     <0=> Disabled
//     <1=> PTG0<selection=PTG0_SIG_SEL,GPIOB_16>
//     <0=> Default
#define GPIOB_16_PIN_SEL     0
#if GPIOB_16_PIN_SEL == 1
#define GPIOB_16_GPIO        digitalIO_PTG0
#define GPIOB_16_FN          0
#endif

// Pin Mapping for GPIOB_17 signal
//   <o> GPIOB_17 [PTG1]<name=GPIOB_17_PIN_SEL>
//   <i> Shows which pin GPIOB_17 is mapped to
//     <0=> Disabled
//     <1=> PTG1<selection=PTG1_SIG_SEL,GPIOB_17>
//     <0=> Default
#define GPIOB_17_PIN_SEL     0
#if GPIOB_17_PIN_SEL == 1
#define GPIOB_17_GPIO        digitalIO_PTG1
#define GPIOB_17_FN          0
#endif

// Pin Mapping for GPIOB_18 signal
//   <o> GPIOB_18 [PTG2]<name=GPIOB_18_PIN_SEL>
//   <i> Shows which pin GPIOB_18 is mapped to
//     <0=> Disabled
//     <1=> PTG2<selection=PTG2_SIG_SEL,GPIOB_18>
//     <0=> Default
#define GPIOB_18_PIN_SEL     0
#if GPIOB_18_PIN_SEL == 1
#define GPIOB_18_GPIO        digitalIO_PTG2
#define GPIOB_18_FN          0
#endif

// Pin Mapping for GPIOB_19 signal
//   <o> GPIOB_19 [PTG3]<name=GPIOB_19_PIN_SEL>
//   <i> Shows which pin GPIOB_19 is mapped to
//     <0=> Disabled
//     <1=> PTG3<selection=PTG3_SIG_SEL,GPIOB_19>
//     <0=> Default
#define GPIOB_19_PIN_SEL     0
#if GPIOB_19_PIN_SEL == 1
#define GPIOB_19_GPIO        digitalIO_PTG3
#define GPIOB_19_FN          0
#endif

// Pin Mapping for GPIOB_20 signal
//   <o> GPIOB_20 [PTG4]<name=GPIOB_20_PIN_SEL>
//   <i> Shows which pin GPIOB_20 is mapped to
//     <0=> Disabled
//     <1=> PTG4<selection=PTG4_SIG_SEL,GPIOB_20>
//     <0=> Default
#define GPIOB_20_PIN_SEL     0
#if GPIOB_20_PIN_SEL == 1
#define GPIOB_20_GPIO        digitalIO_PTG4
#define GPIOB_20_FN          0
#endif

// Pin Mapping for GPIOB_21 signal
//   <o> GPIOB_21 [PTG5]<name=GPIOB_21_PIN_SEL>
//   <i> Shows which pin GPIOB_21 is mapped to
//     <0=> Disabled
//     <1=> PTG5 (Alias:LED_RED)<selection=PTG5_SIG_SEL,GPIOB_21>
//     <1=> Default
#define GPIOB_21_PIN_SEL     1
#if GPIOB_21_PIN_SEL == 1
#define GPIOB_21_GPIO        digitalIO_PTG5
#define GPIOB_21_FN          0
#endif

// Pin Mapping for GPIOB_22 signal
//   <o> GPIOB_22 [PTG6]<name=GPIOB_22_PIN_SEL>
//   <i> Shows which pin GPIOB_22 is mapped to
//     <0=> Disabled
//     <1=> PTG6 (Alias:LED_GREEN)<selection=PTG6_SIG_SEL,GPIOB_22>
//     <1=> Default
#define GPIOB_22_PIN_SEL     1
#if GPIOB_22_PIN_SEL == 1
#define GPIOB_22_GPIO        digitalIO_PTG6
#define GPIOB_22_FN          0
#endif

// Pin Mapping for GPIOB_23 signal
//   <o> GPIOB_23 [PTG7]<name=GPIOB_23_PIN_SEL>
//   <i> Shows which pin GPIOB_23 is mapped to
//     <0=> Disabled
//     <1=> PTG7 (Alias:LED_BLUE)<selection=PTG7_SIG_SEL,GPIOB_23>
//     <1=> Default
#define GPIOB_23_PIN_SEL     1
#if GPIOB_23_PIN_SEL == 1
#define GPIOB_23_GPIO        digitalIO_PTG7
#define GPIOB_23_FN          0
#endif

// Pin Mapping for GPIOB_24 signal
//   <o> GPIOB_24 [PTH0]<name=GPIOB_24_PIN_SEL>
//   <i> Shows which pin GPIOB_24 is mapped to
//     <0=> Disabled
//     <1=> PTH0<selection=PTH0_SIG_SEL,GPIOB_24>
//     <0=> Default
#define GPIOB_24_PIN_SEL     0
#if GPIOB_24_PIN_SEL == 1
#define GPIOB_24_GPIO        digitalIO_PTH0
#define GPIOB_24_FN          0
#endif

// Pin Mapping for GPIOB_25 signal
//   <o> GPIOB_25 [PTH1]<name=GPIOB_25_PIN_SEL>
//   <i> Shows which pin GPIOB_25 is mapped to
//     <0=> Disabled
//     <1=> PTH1<selection=PTH1_SIG_SEL,GPIOB_25>
//     <0=> Default
#define GPIOB_25_PIN_SEL     0
#if GPIOB_25_PIN_SEL == 1
#define GPIOB_25_GPIO        digitalIO_PTH1
#define GPIOB_25_FN          0
#endif

// Pin Mapping for GPIOB_26 signal
//   <o> GPIOB_26 [PTH2]<name=GPIOB_26_PIN_SEL>
//   <i> Shows which pin GPIOB_26 is mapped to
//     <0=> Disabled
//     <1=> PTH2<selection=PTH2_SIG_SEL,GPIOB_26>
//     <0=> Default
#define GPIOB_26_PIN_SEL     0
#if GPIOB_26_PIN_SEL == 1
#define GPIOB_26_GPIO        digitalIO_PTH2
#define GPIOB_26_FN          0
#endif

// Pin Mapping for GPIOB_27 signal
//   <o> GPIOB_27 [PTH3]<name=GPIOB_27_PIN_SEL>
//   <i> Shows which pin GPIOB_27 is mapped to
//     <0=> Disabled
//     <1=> PTH3<selection=PTH3_SIG_SEL,GPIOB_27>
//     <0=> Default
#define GPIOB_27_PIN_SEL     0
#if GPIOB_27_PIN_SEL == 1
#define GPIOB_27_GPIO        digitalIO_PTH3
#define GPIOB_27_FN          0
#endif

// Pin Mapping for GPIOB_28 signal
//   <o> GPIOB_28 [PTH4]<name=GPIOB_28_PIN_SEL>
//   <i> Shows which pin GPIOB_28 is mapped to
//     <0=> Disabled
//     <1=> PTH4<selection=PTH4_SIG_SEL,GPIOB_28>
//     <0=> Default
#define GPIOB_28_PIN_SEL     0
#if GPIOB_28_PIN_SEL == 1
#define GPIOB_28_GPIO        digitalIO_PTH4
#define GPIOB_28_FN          0
#endif

// Pin Mapping for GPIOB_29 signal
//   <o> GPIOB_29 [PTH5]<name=GPIOB_29_PIN_SEL>
//   <i> Shows which pin GPIOB_29 is mapped to
//     <0=> Disabled
//     <1=> PTH5<selection=PTH5_SIG_SEL,GPIOB_29>
//     <0=> Default
#define GPIOB_29_PIN_SEL     0
#if GPIOB_29_PIN_SEL == 1
#define GPIOB_29_GPIO        digitalIO_PTH5
#define GPIOB_29_FN          0
#endif

// Pin Mapping for GPIOB_30 signal
//   <o> GPIOB_30 [PTH6]<name=GPIOB_30_PIN_SEL>
//   <i> Shows which pin GPIOB_30 is mapped to
//     <0=> Disabled
//     <1=> PTH6<selection=PTH6_SIG_SEL,GPIOB_30>
//     <0=> Default
#define GPIOB_30_PIN_SEL     0
#if GPIOB_30_PIN_SEL == 1
#define GPIOB_30_GPIO        digitalIO_PTH6
#define GPIOB_30_FN          0
#endif

// Pin Mapping for GPIOB_31 signal
//   <o> GPIOB_31 [PTH7]<name=GPIOB_31_PIN_SEL>
//   <i> Shows which pin GPIOB_31 is mapped to
//     <0=> Disabled
//     <1=> PTH7<selection=PTH7_SIG_SEL,GPIOB_31>
//     <0=> Default
#define GPIOB_31_PIN_SEL     0
#if GPIOB_31_PIN_SEL == 1
#define GPIOB_31_GPIO        digitalIO_PTH7
#define GPIOB_31_FN          0
#endif

