podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKE06Z4.h
// </h>

// <h> General Purpose I/O (GPIOC)

// Pin Mapping for GPIOC_0 signal
//   <o> GPIOC_0 [PTI0]<name=GPIOC_0_PIN_SEL>
//   <i> Shows which pin GPIOC_0 is mapped to
//     <0=> Disabled
//     <1=> PTI0<selection=PTI0_SIG_SEL,GPIOC_0>
//     <0=> Default
#define GPIOC_0_PIN_SEL      0
#if GPIOC_0_PIN_SEL == 1
#define GPIOC_0_GPIO         digitalIO_PTI0
#define GPIOC_0_FN           0
#endif

// Pin Mapping for GPIOC_1 signal
//   <o> GPIOC_1 [PTI1]<name=GPIOC_1_PIN_SEL>
//   <i> Shows which pin GPIOC_1 is mapped to
//     <0=> Disabled
//     <1=> PTI1<selection=PTI1_SIG_SEL,GPIOC_1>
//     <0=> Default
#define GPIOC_1_PIN_SEL      0
#if GPIOC_1_PIN_SEL == 1
#define GPIOC_1_GPIO         digitalIO_PTI1
#define GPIOC_1_FN           0
#endif

// Pin Mapping for GPIOC_2 signal
//   <o> GPIOC_2 [PTI2]<name=GPIOC_2_PIN_SEL>
//   <i> Shows which pin GPIOC_2 is mapped to
//     <0=> Disabled
//     <1=> PTI2<selection=PTI2_SIG_SEL,GPIOC_2>
//     <0=> Default
#define GPIOC_2_PIN_SEL      0
#if GPIOC_2_PIN_SEL == 1
#define GPIOC_2_GPIO         digitalIO_PTI2
#define GPIOC_2_FN           0
#endif

// Pin Mapping for GPIOC_3 signal
//   <o> GPIOC_3 [PTI3]<name=GPIOC_3_PIN_SEL>
//   <i> Shows which pin GPIOC_3 is mapped to
//     <0=> Disabled
//     <1=> PTI3<selection=PTI3_SIG_SEL,GPIOC_3>
//     <0=> Default
#define GPIOC_3_PIN_SEL      0
#if GPIOC_3_PIN_SEL == 1
#define GPIOC_3_GPIO         digitalIO_PTI3
#define GPIOC_3_FN           0
#endif

// Pin Mapping for GPIOC_4 signal
//   <o> GPIOC_4 [PTI4]<name=GPIOC_4_PIN_SEL>
//   <i> Shows which pin GPIOC_4 is mapped to
//     <0=> Disabled
//     <1=> PTI4<selection=PTI4_SIG_SEL,GPIOC_4>
//     <0=> Default
#define GPIOC_4_PIN_SEL      0
#if GPIOC_4_PIN_SEL == 1
#define GPIOC_4_GPIO         digitalIO_PTI4
#define GPIOC_4_FN           0
#endif

// Pin Mapping for GPIOC_5 signal
//   <o> GPIOC_5 [PTI5]<name=GPIOC_5_PIN_SEL>
//   <i> Shows which pin GPIOC_5 is mapped to
//     <0=> Disabled
//     <1=> PTI5<selection=PTI5_SIG_SEL,GPIOC_5>
//     <0=> Default
#define GPIOC_5_PIN_SEL      0
#if GPIOC_5_PIN_SEL == 1
#define GPIOC_5_GPIO         digitalIO_PTI5
#define GPIOC_5_FN           0
#endif

// Pin Mapping for GPIOC_6 signal
//   <o> GPIOC_6 [PTI6]<name=GPIOC_6_PIN_SEL>
//   <i> Shows which pin GPIOC_6 is mapped to
//     <0=> Disabled
//     <1=> PTI6<selection=PTI6_SIG_SEL,GPIOC_6>
//     <0=> Default
#define GPIOC_6_PIN_SEL      0
#if GPIOC_6_PIN_SEL == 1
#define GPIOC_6_GPIO         digitalIO_PTI6
#define GPIOC_6_FN           0
#endif

// </h>

// <h> Inter-Integrated Circuit (I2C0)

// Pin Mapping for I2C0_SCL signal
//   <o> I2C0_SCL [PTB7, PTA3]<name=I2C0_SCL_PIN_SEL>
//   <i> Shows which pin I2C0_SCL is mapped to
//     <0=> Disabled
//     <1=> PTB7<selection=PTB7_SIG_SEL,I2C0_SCL>
//     <2=> PTA3<selection=PTA3_SIG_SEL,I2C0_SCL>
//     <0=> Default
#define I2C0_SCL_PIN_SEL     0
#if I2C0_SCL_PIN_SEL == 1
#define I2C0_SCL_GPIO        digitalIO_PTB7
#define I2C0_SCL_FN          2
#elif I2C0_SCL_PIN_SEL == 2
#define I2C0_SCL_GPIO        digitalIO_PTA3
#define I2C0_SCL_FN          3
#endif

// Pin Mapping for I2C0_4WSDAOUT signal
//   <o> I2C0_4WSDAOUT [PTA1]<name=I2C0_4WSDAOUT_PIN_SEL>
//   <i> Shows which pin I2C0_4WSDAOUT is mapped to
//     <0=> Disabled
//     <1=> PTA1<selection=PTA1_SIG_SEL,I2C0_4WSDAOUT>
//     <0=> Default
#define I2C0_4WSDAOUT_PIN_SEL 0
#if I2C0_4WSDAOUT_PIN_SEL == 1
#define I2C0_4WSDAOUT_GPIO   digitalIO_PTA1
#define I2C0_4WSDAOUT_FN     3
#endif

// Pin Mapping for I2C0_SDA signal
//   <o> I2C0_SDA [PTB6, PTA2]<name=I2C0_SDA_PIN_SEL>
//   <i> Shows which pin I2C0_SDA is mapped to
//     <0=> Disabled
//     <1=> PTB6<selection=PTB6_SIG_SEL,I2C0_SDA>
//     <2=> PTA2<selection=PTA2_SIG_SEL,I2C0_SDA>
//     <0=> Default
#define I2C0_SDA_PIN_SEL     0
#if I2C0_SDA_PIN_SEL == 1
#define I2C0_SDA_GPIO        digitalIO_PTB6
#define I2C0_SDA_FN          2
#elif I2C0_SDA_PIN_SEL == 2
#define I2C0_SDA_GPIO        digitalIO_PTA2
#define I2C0_SDA_FN          3
#endif

// Pin Mapping for I2C0_4WSCLOUT signal
//   <o> I2C0_4WSCLOUT [PTA0]<name=I2C0_4WSCLOUT_PIN_SEL>
//   <i> Shows which pin I2C0_4WSCLOUT is mapped to
//     <0=> Disabled
//     <1=> PTA0<selection=PTA0_SIG_SEL,I2C0_4WSCLOUT>
//     <0=> Default
#define I2C0_4WSCLOUT_PIN_SEL 0
#if I2C0_4WSCLOUT_PIN_SEL == 1
#define I2C0_4WSCLOUT_GPIO   digitalIO_PTA0
#define I2C0_4WSCLOUT_FN     3
#endif

// </h>

// <h> Inter-Integrated Circuit (I2C1)

// Pin Mapping for I2C1_SDA signal
//   <o> I2C1_SDA [PTH3, PTE0]<name=I2C1_SDA_PIN_SEL>
//   <i> Shows which pin I2C1_SDA is mapped to
//     <0=> Disabled
//     <1=> PTH3<selection=PTH3_SIG_SEL,I2C1_SDA>
//     <2=> PTE0<selection=PTE0_SIG_SEL,I2C1_SDA>
//     <0=> Default
#define I2C1_SDA_PIN_SEL     0
#if I2C1_SDA_PIN_SEL == 1
#define I2C1_SDA_GPIO        digitalIO_PTH3
#define I2C1_SDA_FN          2
#elif I2C1_SDA_PIN_SEL == 2
#define I2C1_SDA_GPIO        digitalIO_PTE0
#define I2C1_SDA_FN          4
#endif

// Pin Mapping for I2C1_SCL signal
//   <o> I2C1_SCL [PTH4, PTE1]<name=I2C1_SCL_PIN_SEL>
//   <i> Shows which pin I2C1_SCL is mapped to
//     <0=> Disabled
//     <1=> PTH4<selection=PTH4_SIG_SEL,I2C1_SCL>
//     <2=> PTE1<selection=PTE1_SIG_SEL,I2C1_SCL>
//     <0=> Default
#define I2C1_SCL_PIN_SEL     0
#if I2C1_SCL_PIN_SEL == 1
#define I2C1_SCL_GPIO        digitalIO_PTH4
#define I2C1_SCL_FN          2
#elif I2C1_SCL_PIN_SEL == 2
#define I2C1_SCL_GPIO        digitalIO_PTE1
#define I2C1_SCL_FN          4
#endif

// </h>

// <h> Debug and Control

// Pin Mapping for NMI_b signal
//   <o> NMI_b [PTB4]<name=NMI_b_PIN_SEL>
//   <i> Shows which pin NMI_b is mapped to
//     <0=> Disabled
//     <1=> PTB4 (reset default)<selection=PTB4_SIG_SEL,NMI_b (reset default)>
//     <2=> PTB4<selection=PTB4_SIG_SEL,NMI_b>
//     <1=> Default
#define NMI_b_PIN_SEL        1
#if NMI_b_PIN_SEL == 2
#define NMI_b_GPIO           digitalIO_PTB4
#define NMI_b_FN             5
#endif

// Pin Mapping for RESET_b signal
//   <o> RESET_b [PTA5]<name=RESET_b_PIN_SEL>
//   <i> Shows which pin RESET_b is mapped to
//     <0=> Disabled
//     <1=> PTA5 (reset default)<selection=PTA5_SIG_SEL,RESET_b (reset default)>
//     <2=> PTA5<selection=PTA5_SIG_SEL,RESET_b>
//     <1=> Default
#define RESET_b_PIN_SEL      1
#if RESET_b_PIN_SEL == 2
#define RESET_b_GPIO         digitalIO_PTA5
#define RESET_b_FN           4
#endif

// Pin Mapping for SWD_CLK signal
//   <o> SWD_CLK [PTC4]<name=SWD_CLK_PIN_SEL>
//   <i> Shows which pin SWD_CLK is mapped to
//     <0=> Disabled
//     <1=> PTC4 (reset default)<selection=PTC4_SIG_SEL,SWD_CLK (reset default)>
//     <2=> PTC4<selection=PTC4_SIG_SEL,SWD_CLK>
//     <1=> Default
#define SWD_CLK_PIN_SEL      1
#if SWD_CLK_PIN_SEL == 2
#define SWD_CLK_GPIO         digitalIO_PTC4
#define SWD_CLK_FN           5
#endif

// Pin Mapping for SWD_DIO signal
//   <o> SWD_DIO [PTA4]<name=SWD_DIO_PIN_SEL>
//   <i> Shows which pin SWD_DIO is mapped to
//     <0=> Disabled
//     <1=> PTA4 (reset default)<selection=PTA4_SIG_SEL,SWD_DIO (reset default)>
//     <2=> PTA4<selection=PTA4_SIG_SEL,SWD_DIO>
//     <1=> Default
#define SWD_DIO_PIN_SEL      1
#if SWD_DIO_PIN_SEL == 2
#define SWD_DIO_GPIO         digitalIO_PTA4
#define SWD_DIO_FN           4
#endif

