podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKE06Z4.h
// </h>

// <h> Serial Peripheral Interface (SPI0)

// Pin Mapping for SPI0_MISO signal
//   <o> SPI0_MISO [PTE2, PTB4]<name=SPI0_MISO_PIN_SEL>
//   <i> Shows which pin SPI0_MISO is mapped to
//     <0=> Disabled
//     <1=> PTE2<selection=PTE2_SIG_SEL,SPI0_MISO>
//     <2=> PTB4<selection=PTB4_SIG_SEL,SPI0_MISO>
//     <0=> Default
#define SPI0_MISO_PIN_SEL    0
#if SPI0_MISO_PIN_SEL == 1
#define SPI0_MISO_GPIO       digitalIO_PTE2
#define SPI0_MISO_FN         2
#elif SPI0_MISO_PIN_SEL == 2
#define SPI0_MISO_GPIO       digitalIO_PTB4
#define SPI0_MISO_FN         3
#endif

// Pin Mapping for SPI0_MOSI signal
//   <o> SPI0_MOSI [PTB3, PTE1]<name=SPI0_MOSI_PIN_SEL>
//   <i> Shows which pin SPI0_MOSI is mapped to
//     <0=> Disabled
//     <1=> PTB3<selection=PTB3_SIG_SEL,SPI0_MOSI>
//     <2=> PTE1<selection=PTE1_SIG_SEL,SPI0_MOSI>
//     <0=> Default
#define SPI0_MOSI_PIN_SEL    0
#if SPI0_MOSI_PIN_SEL == 1
#define SPI0_MOSI_GPIO       digitalIO_PTB3
#define SPI0_MOSI_FN         2
#elif SPI0_MOSI_PIN_SEL == 2
#define SPI0_MOSI_GPIO       digitalIO_PTE1
#define SPI0_MOSI_FN         2
#endif

// Pin Mapping for SPI0_PCS signal
//   <o> SPI0_PCS [PTE3, PTB5]<name=SPI0_PCS_PIN_SEL>
//   <i> Shows which pin SPI0_PCS is mapped to
//     <0=> Disabled
//     <1=> PTE3<selection=PTE3_SIG_SEL,SPI0_PCS>
//     <2=> PTB5<selection=PTB5_SIG_SEL,SPI0_PCS>
//     <0=> Default
#define SPI0_PCS_PIN_SEL     0
#if SPI0_PCS_PIN_SEL == 1
#define SPI0_PCS_GPIO        digitalIO_PTE3
#define SPI0_PCS_FN          2
#elif SPI0_PCS_PIN_SEL == 2
#define SPI0_PCS_GPIO        digitalIO_PTB5
#define SPI0_PCS_FN          3
#endif

// Pin Mapping for SPI0_SCK signal
//   <o> SPI0_SCK [PTB2, PTE0]<name=SPI0_SCK_PIN_SEL>
//   <i> Shows which pin SPI0_SCK is mapped to
//     <0=> Disabled
//     <1=> PTB2<selection=PTB2_SIG_SEL,SPI0_SCK>
//     <2=> PTE0<selection=PTE0_SIG_SEL,SPI0_SCK>
//     <0=> Default
#define SPI0_SCK_PIN_SEL     0
#if SPI0_SCK_PIN_SEL == 1
#define SPI0_SCK_GPIO        digitalIO_PTB2
#define SPI0_SCK_FN          2
#elif SPI0_SCK_PIN_SEL == 2
#define SPI0_SCK_GPIO        digitalIO_PTE0
#define SPI0_SCK_FN          2
#endif

// </h>

// <h> Serial Peripheral Interface (SPI1)

// Pin Mapping for SPI1_MISO signal
//   <o> SPI1_MISO [PTD2, PTG6]<name=SPI1_MISO_PIN_SEL>
//   <i> Shows which pin SPI1_MISO is mapped to
//     <0=> Disabled
//     <1=> PTD2<selection=PTD2_SIG_SEL,SPI1_MISO>
//     <2=> PTG6 (Alias:LED_GREEN)<selection=PTG6_SIG_SEL,SPI1_MISO>
//     <0=> Default
#define SPI1_MISO_PIN_SEL    0
#if SPI1_MISO_PIN_SEL == 1
#define SPI1_MISO_GPIO       digitalIO_PTD2
#define SPI1_MISO_FN         2
#elif SPI1_MISO_PIN_SEL == 2
#define SPI1_MISO_GPIO       digitalIO_PTG6
#define SPI1_MISO_FN         3
#endif

// Pin Mapping for SPI1_MOSI signal
//   <o> SPI1_MOSI [PTD1, PTG5]<name=SPI1_MOSI_PIN_SEL>
//   <i> Shows which pin SPI1_MOSI is mapped to
//     <0=> Disabled
//     <1=> PTD1<selection=PTD1_SIG_SEL,SPI1_MOSI>
//     <2=> PTG5 (Alias:LED_RED)<selection=PTG5_SIG_SEL,SPI1_MOSI>
//     <0=> Default
#define SPI1_MOSI_PIN_SEL    0
#if SPI1_MOSI_PIN_SEL == 1
#define SPI1_MOSI_GPIO       digitalIO_PTD1
#define SPI1_MOSI_FN         3
#elif SPI1_MOSI_PIN_SEL == 2
#define SPI1_MOSI_GPIO       digitalIO_PTG5
#define SPI1_MOSI_FN         3
#endif

// Pin Mapping for SPI1_PCS signal
//   <o> SPI1_PCS [PTD3, PTG7]<name=SPI1_PCS_PIN_SEL>
//   <i> Shows which pin SPI1_PCS is mapped to
//     <0=> Disabled
//     <1=> PTD3<selection=PTD3_SIG_SEL,SPI1_PCS>
//     <2=> PTG7 (Alias:LED_BLUE)<selection=PTG7_SIG_SEL,SPI1_PCS>
//     <0=> Default
#define SPI1_PCS_PIN_SEL     0
#if SPI1_PCS_PIN_SEL == 1
#define SPI1_PCS_GPIO        digitalIO_PTD3
#define SPI1_PCS_FN          2
#elif SPI1_PCS_PIN_SEL == 2
#define SPI1_PCS_GPIO        digitalIO_PTG7
#define SPI1_PCS_FN          3
#endif

// Pin Mapping for SPI1_SCK signal
//   <o> SPI1_SCK [PTD0, PTG4]<name=SPI1_SCK_PIN_SEL>
//   <i> Shows which pin SPI1_SCK is mapped to
//     <0=> Disabled
//     <1=> PTD0<selection=PTD0_SIG_SEL,SPI1_SCK>
//     <2=> PTG4<selection=PTG4_SIG_SEL,SPI1_SCK>
//     <0=> Default
#define SPI1_SCK_PIN_SEL     0
#if SPI1_SCK_PIN_SEL == 1
#define SPI1_SCK_GPIO        digitalIO_PTD0
#define SPI1_SCK_FN          3
#elif SPI1_SCK_PIN_SEL == 2
#define SPI1_SCK_GPIO        digitalIO_PTG4
#define SPI1_SCK_FN          3
#endif

// </h>

// <h> Universal Asynchronous Rx/Tx (UART0)

// Pin Mapping for UART0_RX signal
//   <o> UART0_RX [PTA2, PTB0]<name=UART0_RX_PIN_SEL>
//   <i> Shows which pin UART0_RX is mapped to
//     <0=> Disabled
//     <1=> PTA2<selection=PTA2_SIG_SEL,UART0_RX>
//     <2=> PTB0<selection=PTB0_SIG_SEL,UART0_RX>
//     <0=> Default
#define UART0_RX_PIN_SEL     0
#if UART0_RX_PIN_SEL == 1
#define UART0_RX_GPIO        digitalIO_PTA2
#define UART0_RX_FN          2
#elif UART0_RX_PIN_SEL == 2
#define UART0_RX_GPIO        digitalIO_PTB0
#define UART0_RX_FN          2
#endif

// Pin Mapping for UART0_TX signal
//   <o> UART0_TX [PTA3, PTB1]<name=UART0_TX_PIN_SEL>
//   <i> Shows which pin UART0_TX is mapped to
//     <0=> Disabled
//     <1=> PTA3<selection=PTA3_SIG_SEL,UART0_TX>
//     <2=> PTB1<selection=PTB1_SIG_SEL,UART0_TX>
//     <0=> Default
#define UART0_TX_PIN_SEL     0
#if UART0_TX_PIN_SEL == 1
#define UART0_TX_GPIO        digitalIO_PTA3
#define UART0_TX_FN          2
#elif UART0_TX_PIN_SEL == 2
#define UART0_TX_GPIO        digitalIO_PTB1
#define UART0_TX_FN          2
#endif

// </h>

// <h> Universal Asynchronous Rx/Tx (UART1)

// Pin Mapping for UART1_RX signal
//   <o> UART1_RX [PTC6, PTF2]<name=UART1_RX_PIN_SEL>
//   <i> Shows which pin UART1_RX is mapped to
//     <0=> Disabled
//     <1=> PTC6<selection=PTC6_SIG_SEL,UART1_RX>
//     <2=> PTF2<selection=PTF2_SIG_SEL,UART1_RX>
//     <0=> Default
#define UART1_RX_PIN_SEL     0
#if UART1_RX_PIN_SEL == 1
#define UART1_RX_GPIO        digitalIO_PTC6
#define UART1_RX_FN          2
#elif UART1_RX_PIN_SEL == 2
#define UART1_RX_GPIO        digitalIO_PTF2
#define UART1_RX_FN          2
#endif

// Pin Mapping for UART1_TX signal
//   <o> UART1_TX [PTC7, PTF3]<name=UART1_TX_PIN_SEL>
//   <i> Shows which pin UART1_TX is mapped to
//     <0=> Disabled
//     <1=> PTC7<selection=PTC7_SIG_SEL,UART1_TX>
//     <2=> PTF3<selection=PTF3_SIG_SEL,UART1_TX>
//     <0=> Default
#define UART1_TX_PIN_SEL     0
#if UART1_TX_PIN_SEL == 1
#define UART1_TX_GPIO        digitalIO_PTC7
#define UART1_TX_FN          2
#elif UART1_TX_PIN_SEL == 2
#define UART1_TX_GPIO        digitalIO_PTF3
#define UART1_TX_FN          2
#endif

