podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKE06Z4.h
// </h>

// <h> Universal Asynchronous Rx/Tx (UART2)

// Pin Mapping for UART2_RX signal
//   <o> UART2_RX [PTD6, PTI0]<name=UART2_RX_PIN_SEL>
//   <i> Shows which pin UART2_RX is mapped to
//     <0=> Disabled
//     <1=> PTD6<selection=PTD6_SIG_SEL,UART2_RX>
//     <2=> PTI0<selection=PTI0_SIG_SEL,UART2_RX>
//     <0=> Default
#define UART2_RX_PIN_SEL     0
#if UART2_RX_PIN_SEL == 1
#define UART2_RX_GPIO        digitalIO_PTD6
#define UART2_RX_FN          2
#elif UART2_RX_PIN_SEL == 2
#define UART2_RX_GPIO        digitalIO_PTI0
#define UART2_RX_FN          3
#endif

// Pin Mapping for UART2_TX signal
//   <o> UART2_TX [PTD7, PTI1]<name=UART2_TX_PIN_SEL>
//   <i> Shows which pin UART2_TX is mapped to
//     <0=> Disabled
//     <1=> PTD7<selection=PTD7_SIG_SEL,UART2_TX>
//     <2=> PTI1<selection=PTI1_SIG_SEL,UART2_TX>
//     <0=> Default
#define UART2_TX_PIN_SEL     0
#if UART2_TX_PIN_SEL == 1
#define UART2_TX_GPIO        digitalIO_PTD7
#define UART2_TX_FN          2
#elif UART2_TX_PIN_SEL == 2
#define UART2_TX_GPIO        digitalIO_PTI1
#define UART2_TX_FN          3
#endif

// </h>

// </e>

//-------- <<< end of configuration section >>> -----------------  

#define FIXED_ADC_FN             0                    // Fixed ADC Multiplexing value
#define FIXED_GPIO_FN            1                    // Fixed GPIO Multiplexing value
#define FIXED_PORT_CLOCK_REG     SCGC5                // Fixed PORT Clock
#define ACMP0_CLOCK_REG      SCGC
#define ACMP0_CLOCK_MASK     SIM_SCGC_ACMP0_MASK
#define ACMP1_CLOCK_REG      SCGC
#define ACMP1_CLOCK_MASK     SIM_SCGC_ACMP1_MASK
#define ADC0_CLOCK_REG       SCGC
#define ADC0_CLOCK_MASK      SIM_SCGC_ADC0_MASK
#define CRC_CLOCK_REG        SCGC
#define CRC_CLOCK_MASK       SIM_SCGC_CRC_MASK
#define FTM0_CLOCK_REG       SCGC
#define FTM0_CLOCK_MASK      SIM_SCGC_FTM0_MASK
#define FTM1_CLOCK_REG       SCGC
#define FTM1_CLOCK_MASK      SIM_SCGC_FTM1_MASK
#define FTM2_CLOCK_REG       SCGC
#define FTM2_CLOCK_MASK      SIM_SCGC_FTM2_MASK
#define I2C0_CLOCK_REG       SCGC
#define I2C0_CLOCK_MASK      SIM_SCGC_I2C0_MASK
#define I2C1_CLOCK_REG       SCGC
#define I2C1_CLOCK_MASK      SIM_SCGC_I2C1_MASK
#define IRQ_CLOCK_REG        SCGC
#define IRQ_CLOCK_MASK       SIM_SCGC_IRQ_MASK
#define KBI0_CLOCK_REG       SCGC
#define KBI0_CLOCK_MASK      SIM_SCGC_KBI0_MASK
#define KBI1_CLOCK_REG       SCGC
#define KBI1_CLOCK_MASK      SIM_SCGC_KBI1_MASK
#define MSCAN_CLOCK_REG      SCGC
#define MSCAN_CLOCK_MASK     SIM_SCGC_MSCAN_MASK
#define PIT_CLOCK_REG        SCGC
#define PIT_CLOCK_MASK       SIM_SCGC_PIT_MASK
#define PWT_CLOCK_REG        SCGC
#define PWT_CLOCK_MASK       SIM_SCGC_PWT_MASK
#define RTC_CLOCK_REG        SCGC
#define RTC_CLOCK_MASK       SIM_SCGC_RTC_MASK
#define SPI0_CLOCK_REG       SCGC
#define SPI0_CLOCK_MASK      SIM_SCGC_SPI0_MASK
#define SPI1_CLOCK_REG       SCGC
#define SPI1_CLOCK_MASK      SIM_SCGC_SPI1_MASK
#define SWD_CLOCK_REG        SCGC
#define SWD_CLOCK_MASK       SIM_SCGC_SWD_MASK
#define UART0_CLOCK_REG      SCGC
#define UART0_CLOCK_MASK     SIM_SCGC_UART0_MASK
#define UART1_CLOCK_REG      SCGC
#define UART1_CLOCK_MASK     SIM_SCGC_UART1_MASK
#define UART2_CLOCK_REG      SCGC
#define UART2_CLOCK_MASK     SIM_SCGC_UART2_MASK
#define PORT_CLOCK_REG       SCGC5


#endif /* PIN_MAPPING_H_ */
